resources/langs/cpp/index.org
#+title: ACM Computing Seminar C++ Guide
#+author: Matt Hancock
#+date: 
#+options: html-postamble:nil
#+property: header-args :mkdirp yes :cache yes
#+options: H:4
#+html_head: <link rel="stylesheet" type="text/css" href="../css/main.css">
#+html_head: <script src="../js/main.js"></script>
#+html: <div id="main">
#+html: <div id="footer"><a href="../../../">ACM Computing Seminar Home</a> &mdash; This work is licensed under a <a rel="license" href="http://creativecommons.org/licenses/by/3.0/deed.en_US">Creative Commons Attribution 3.0 Unported License</a>.</div>
#+html: <a href="javascript:;" id="toc-open">&#9776;</a>
#+html: <a href="javascript:;" id="toc-close">&times;</a>

* Introduction
This manual is a guide for quickly learning C++ for mathematical and 
scientific computing applications. The goal of this guide is not to 
make you a C++ expert, but to quickly teach you enough of the C++ 
fundamentals and design patterns to help you off the ground. If you 
should like to go beyond this guide, a few references are listed below.

** A little about the language
Before you dive in, here is a little about the C++ programming language:

C++ is an extension of the C programming language. Both C and C++ are 
*statically-typed* and *compiled* languages, which means that the *type* 
of variables used in your source code must be declared explicitly and is 
checked when the program is compiled (i.e., translated into a machine 
executable file).

One key difference between C++ and C, however, is that C++ provides 
many mechanisms to allow for [[https://en.wikipedia.org/wiki/Object-oriented_programming][object-oriented programming paradigm]]. This 
essentially allows the software writer to create custom, complex, 
reusable data structures. The object-oriented paradigm is extremely useful, 
but we will only touch the surface of it in this guide.

** Additional references
- [[http://cppreference.com][C++ reference]]
- [[http://www.cplusplus.com/doc/tutorial][C++ tutorials]]
- [[https://en.wikipedia.org/wiki/C%2B%2B][C++ wiki]]
- [[http://stackoverflow.com/questions/388242/the-definitive-c-book-guide-and-list][A compiled list of C++ textbooks from stackoverflow]]

** License, source, etc. 
This document was created using [[https://www.gnu.org/software/emacs/][Emacs]] [[http://orgmode.org/][org mode]] with some custom css and 
javascript. You can find the license, view the source, and contribute 
to this document here:

[[https://github.com/notmatthancock/acm-computing-seminar][https://github.com/notmatthancock/acm-computing-seminar]]

* Getting started
The particular programming tools that you choose to use will
likely be largely influenced by the operating system that you use.
We will use free tools (often developed for GNU / Linux systems) in
this guide. These tools are mostly available in other operating 
systems as well. For example, on Windows, you could use [[https://www.cygwin.com/][Cygwin]], or 
install a dual boot with some Linux distribution (e.g., [[http://www.ubuntu.com/][Ubuntu]]). On the 
other hand, MAC OSX, being a BSD-derived system, has many of the 
required tools already available (although, a command line utility, 
[[http://brew.sh][Brew]], makes building and installing other tools very simple).

In the following two sections, we'll talk about the two basic types of 
software that you'll need to begin writing C++ programs.

** Text editors

The text editor that you choose to use should be be any program 
capable of editing plain text files. However, you may find that it's 
more productive to write in an editor that offers features such as 
syntax highlighting, code-completion, bracket-matching, or other features. 
Here are some popular free text editors:

- [[https://atom.io/][Atom]] is a recently open-sourced GUI editor which some have compared to the very popular non-free editor, [[https://sublimetext.com][Sublime Text]].
- [[https://www.gnu.org/software/emacs/][Emacs]] is another powerful editor, which allows for highly optimized workflows.
- [[https://wiki.gnome.org/Apps/Gedit][Gedit]] is a nice and simple GUI editor, which is the default in GNOME desktop environment.
- [[https://kate-editor.org][Kate]] is a another simple GUI editor, which is the default in the KDE desktop environment.
- [[http://www.vim.org][Vim]] is a modal editor with a steep learning curve. It offers highly efficient means to edit text, and is available (or it's predecessor, vi) by default on nearly all UNIX-like operating systems.

** Compilers

Second, you'll need a program called a *compiler*. A compiler translates 
the high-level C++ language into an executable program. In this guide, we 
will use the =g++= compiler which is freely available through the 
[[https://gcc.gnu.org/][gnu compiler collection (gcc)]].

=g++= is a program which you typically call from the command line, which 
takes as input, your C++ source code file, and produces as output, a 
binary executable file.

