resources/langs/cpp/index.html
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>ACM Computing Seminar C++ Guide</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content=" "/>
<meta name="author" content="Matt Hancock"/>
</head><body>
<h1 class="title">ACM Computing Seminar C++ Guide</h1>


<div id="main">
<div id="footer"><a href="../../../">ACM Computing Seminar Home</a> &mdash; This work is licensed under a <a rel="license" href="http://creativecommons.org/licenses/by/3.0/deed.en_US">Creative Commons Attribution 3.0 Unported License</a>.</div>
<a href="javascript:;" id="toc-open">&#9776;</a>
<a href="javascript:;" id="toc-close">&times;</a>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Introduction </a>
<ul>
<li><a href="#sec-1.1">1.1 A little about the language </a></li>
<li><a href="#sec-1.2">1.2 Additional references </a></li>
<li><a href="#sec-1.3">1.3 License, source, etc. </a></li>
</ul>
</li>
<li><a href="#sec-2">2 Getting started </a>
<ul>
<li><a href="#sec-2.1">2.1 Text editors </a></li>
<li><a href="#sec-2.2">2.2 Compilers </a></li>
<li><a href="#sec-2.3">2.3 Writing a program </a></li>
</ul>
</li>
<li><a href="#sec-3">3 Data types </a>
<ul>
<li><a href="#sec-3.1">3.1 The <code>bool</code> type </a></li>
<li><a href="#sec-3.2">3.2 <code>int</code> types </a></li>
<li><a href="#sec-3.3">3.3 Floating point types </a></li>
<li><a href="#sec-3.4">3.4 Casting </a></li>
<li><a href="#sec-3.5">3.5 The <code>const</code> modifier </a></li>
<li><a href="#sec-3.6">3.6 The <code>typedef</code> keyword </a></li>
<li><a href="#sec-3.7">3.7 Pointers and references </a>
<ul>
<li><a href="#sec-3.7.1">3.7.1 Pointers </a></li>
<li><a href="#sec-3.7.2">3.7.2 References </a></li>
</ul>
</li>
<li><a href="#sec-3.8">3.8 Arrays </a>
<ul>
<li><a href="#sec-3.8.1">3.8.1 Fixed length arrays </a></li>
<li><a href="#sec-3.8.2">3.8.2 Dynamic length arrays </a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-4">4 Control structures </a>
<ul>
<li><a href="#sec-4.1">4.1 Conditionals </a>
<ul>
<li><a href="#sec-4.1.1">4.1.1 Example: <code>if</code> / <code>else</code> and random number generation </a></li>
<li><a href="#sec-4.1.2">4.1.2 Example: <code>if</code> / <code>else if</code> / <code>else</code> </a></li>
</ul>
</li>
<li><a href="#sec-4.2">4.2 Loops </a>
<ul>
<li><a href="#sec-4.2.1">4.2.1 The <code>for</code> loop </a>
<ul>
<li><a href="#sec-4.2.1.1">4.2.1.1 Example: row-major matrix </a></li>
</ul>
</li>
<li><a href="#sec-4.2.2">4.2.2 The <code>while</code> loop </a>
<ul>
<li><a href="#sec-4.2.2.1">4.2.2.1 Example: truncated sum </a></li>
<li><a href="#sec-4.2.2.2">4.2.2.2 Example: estimating machine epsilon </a></li>
</ul>
</li>
<li><a href="#sec-4.2.3">4.2.3 The <code>break</code> keyword </a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-5">5 Input / Output </a>
<ul>
<li><a href="#sec-5.1">5.1 Inputs to <code>main</code>: <code>argc</code> and <code>argv</code> </a></li>
<li><a href="#sec-5.2">5.2 Filestreams </a>
<ul>
<li><a href="#sec-5.2.1">5.2.1 Reading data from a file </a></li>
<li><a href="#sec-5.2.2">5.2.2 Writing data to a file </a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-6">6 Functions </a>
<ul>
<li><a href="#sec-6.1">6.1 Writing a function </a>
<ul>
<li><a href="#sec-6.1.1">6.1.1 Example: <code>linspace</code>: generating a set of equally-spaced points </a></li>
</ul>
</li>
<li><a href="#sec-6.2">6.2 Header and implementation files </a>
<ul>
<li><a href="#sec-6.2.1">6.2.1 The header file </a></li>
<li><a href="#sec-6.2.2">6.2.2 The implementation file </a></li>
<li><a href="#sec-6.2.3">6.2.3 The file containing <code>main</code> </a></li>
</ul>
</li>
<li><a href="#sec-6.3">6.3 Function pointers </a>
<ul>
<li><a href="#sec-6.3.1">6.3.1 Example: Newton's method for rootfinding </a></li>
<li><a href="#sec-6.3.2">6.3.2 Example: The midpoint rule for definite integrals </a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-7">7 Object-oriented programming </a>
<ul>
<li><a href="#sec-7.1">7.1 Example: a vector <code>class</code> </a>
<ul>
<li><a href="#sec-7.1.1">7.1.1 The header file </a></li>
<li><a href="#sec-7.1.2">7.1.2 The implementation file </a></li>
<li><a href="#sec-7.1.3">7.1.3 Example usage </a></li>
</ul>
</li>
<li><a href="#sec-7.2">7.2 Example cont'd: operator overloading </a>
<ul>
<li><a href="#sec-7.2.1">7.2.1 Overloading <code>operator[]</code> </a></li>
<li><a href="#sec-7.2.2">7.2.2 Overloading <code>operator=</code> </a></li>
</ul>
</li>
<li><a href="#sec-7.3">7.3 Example cont'd: the copy constructor </a></li>
<li><a href="#sec-7.4">7.4 Exampled cont'd: more overloading - <code>operator+</code> </a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">1 Introduction </h2>
<div id="text-1">

<p>This manual is a guide for quickly learning C++ for mathematical and 
scientific computing applications. The goal of this guide is not to 
make you a C++ expert, but to quickly teach you enough of the C++ 
fundamentals and design patterns to help you off the ground. If you 
should like to go beyond this guide, a few references are listed below.
</p>

</div>

<div id="outline-container-1.1" class="outline-3">
<h3 id="sec-1.1">1.1 A little about the language </h3>
<div id="text-1.1">

<p>Before you dive in, here is a little about the C++ programming language:
</p>
<p>
C++ is an extension of the C programming language. Both C and C++ are 
<b>statically-typed</b> and <b>compiled</b> languages, which means that the <b>type</b> 
of variables used in your source code must be declared explicitly and is 
checked when the program is compiled (i.e., translated into a machine 
executable file).
</p>
<p>
One key difference between C++ and C, however, is that C++ provides 
many mechanisms to allow for the <a href="https://en.wikipedia.org/wiki/Object-oriented_programming">object-oriented programming paradigm</a>. This 
essentially allows the software writer to create custom, complex, 
reusable data structures. The object-oriented paradigm is extremely useful, 
but we will only touch the surface of it in this guide.
</p>
</div>

</div>

<div id="outline-container-1.2" class="outline-3">
<h3 id="sec-1.2">1.2 Additional references </h3>
<div id="text-1.2">

<ul>
<li>
<a href="http://cppreference.com">C++ reference</a>
</li>
<li>
<a href="http://www.cplusplus.com/doc/tutorial">C++ tutorials</a>
</li>
<li>
<a href="https://en.wikipedia.org/wiki/C++">C++ wiki</a>
</li>
<li>
<a href="http://stackoverflow.com/questions/388242/the-definitive-c-book-guide-and-list">A compiled list of C++ textbooks from stackoverflow</a>

</li>
</ul>
</div>

</div>

<div id="outline-container-1.3" class="outline-3">
<h3 id="sec-1.3">1.3 License, source, etc. </h3>
<div id="text-1.3">

<p>This document was created using <a href="https://www.gnu.org/software/emacs/">Emacs</a> <a href="http://orgmode.org/">org mode</a> with some custom css and 
javascript. You can find the license, view the source, and contribute 
to this document here:
</p>
<p>
<a href="https://github.com/notmatthancock/acm-computing-seminar">https://github.com/notmatthancock/acm-computing-seminar</a>
</p>
</div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">2 Getting started </h2>
<div id="text-2">

<p>The particular programming tools that you choose to use will
likely be largely influenced by the operating system that you use.
We will use free tools (often developed for GNU / Linux systems) in
this guide. These tools are mostly available in other operating 
systems as well. For example, on Windows, you could use <a href="https://www.cygwin.com/">Cygwin</a>, or 
install a dual boot with some Linux distribution (e.g., <a href="http://www.ubuntu.com/">Ubuntu</a>). On the 
other hand, MAC OSX, being a BSD-derived system, has many of the 
required tools already available (although, a command line utility, 
<a href="http://brew.sh">Brew</a>, makes building and installing other tools very simple).
</p>
<p>
In the following two sections, we'll talk about the two basic types of 
software that you'll need to begin writing C++ programs.
</p>

</div>

<div id="outline-container-2.1" class="outline-3">
<h3 id="sec-2.1">2.1 Text editors </h3>
<div id="text-2.1">


<p>
The text editor that you choose to use should be be any program 
capable of editing plain text files. However, you may find that it's 
more productive to write in an editor that offers features such as 
syntax highlighting, code-completion, bracket-matching, or other features. 
Here are some popular free text editors:
</p>
<ul>
<li>
<a href="https://atom.io/">Atom</a> is a recently open-sourced GUI editor which some have compared to the very popular non-free editor, <a href="https://sublimetext.com">Sublime Text</a>.
</li>
<li>
<a href="https://www.gnu.org/software/emacs/">Emacs</a> is another powerful editor, which allows for highly optimized workflows.
</li>
<li>
<a href="https://wiki.gnome.org/Apps/Gedit">Gedit</a> is a nice and simple GUI editor, which is the default in GNOME desktop environment.
</li>
<li>
<a href="https://kate-editor.org">Kate</a> is a another simple GUI editor, which is the default in the KDE desktop environment.
</li>
<li>
<a href="http://www.vim.org">Vim</a> is a modal editor with a steep learning curve. It offers highly efficient means to edit text, and is available (or it's predecessor, vi) by default on nearly all UNIX-like operating systems.

</li>
</ul>
</div>

</div>

<div id="outline-container-2.2" class="outline-3">
<h3 id="sec-2.2">2.2 Compilers </h3>
<div id="text-2.2">


<p>
Second, you'll need a program called a <b>compiler</b>. A compiler translates 
the high-level C++ language into an executable program. In this guide, we 
will use the <code>g++</code> compiler which is freely available through the 
<a href="https://gcc.gnu.org/">gnu compiler collection (gcc)</a>.
</p>
<p>
<code>g++</code> is a program which you typically call from the command line, which 
takes as input, your C++ source code file, and produces as output, a 
binary executable file.
</p>
</div>

</div>
