resources/langs/cpp/index.org
** Writing a program

Let's create our first C++ program, the obligatory "Hello, world!". First, 
fire-up your text editor and create a file called, =hello.cpp=, with the 
following contents:

#+begin_src cpp -n :tangle src/hello/hello.cpp
  #include <iostream>

  int main() {
    std::cout << "Hello, world!";
    return 0;
  }
#+end_src

Now, to compile the program, execute:

#+begin_src sh :dir src/hello
  g++ hello.cpp
#+end_src

#+RESULTS[2569c75ff851326a2241f3dce1cdb3099b98fca4]:

Followed by:
#+begin_src sh :dir src/hello
  ./a.out
#+end_src

#+RESULTS[5abb9750f318cc870453d631847a2525e5a701ee]:
| Hello | world! |

By default, =g++= names the resulting binary executable, =a.out=, but
you can specify a different output file name by using the =-o= flag:

#+begin_src sh :dir src/hello
  g++ hello.cpp -o my_executable_file.bin
#+end_src

#+RESULTS[9fc39bf8ee6cbae0e89a6dd19cfe230aa8e23c77]:

Note that in Windows, executable files typically end in =.exe=. In Unix-like
systems, there is no particular file-extension type for executables.

* Data types
As we [[A little about the language][mentioned previously]], you must explicitly declare the type of a 
variable. So, in this section, we'll talk about the main variable 
types you'll use. In the section on [[Object-oriented programming][object-oriented programming]], 
we'll discuss how to build more complex data types.

** The =bool= type
A boolean data type is either =true= or =false=. There are a number of 
operators between these types, illustrated in the code snippet below 
(note that lines starting with =//= are comments and are ignored by the 
compiler):

#+begin_src cpp -n :tangle ./src/dtypes/bool/main.cpp
  bool a,b,c; // Declare the type of variables a, b, and c.
  a = true;
  b = false;

  // !  is logical negation when applied to a single variable.
  c = !a; // c is false.

  // && is logical and.
  c = (a && b); // c is false.

  // || is logical or.
  c = (a || b); // c is true.
#+end_src

We don't often use boolean variables by themselves, but rather as a result 
of comparing two other data types (such as comparing if one integer is less 
than another integer). Expressions that result in boolean values are mostly 
used in [[Conditionals][conditional control structures]].

** =int= types

There are [[http://en.cppreference.com/w/cpp/language/types][a variety of integer types]] in C++. Below, we illustrate a 
couple. These can be modified further using the =short= and =long= 
keywords, changing the number of bytes occupied by the variable (and 
hence the maximum and minimum size the variable can take on).

#+begin_src cpp -n :tangle src/dtypes/int/main.cpp
    int a = 6; // initialize a to 6.
    unsigned int b = 7; // initialize b to 7.
    int c; // declare c to be an integer variable.

    a = 6;
    b = 7;

    c = a / b; // c is 0
    c = b / a; // c is 1
    c = b % a; // c is 1 (% is the integer remainder or modulo operator)
    c = a - b; // c is -1
    c = a > b; // c is 0 (boolean gets cast to integer)
    c = a < b; // c is 1 (boolean gets cast to integer)
    c++;       // c is 2 (++ is shorthand for c = c + 1)

    b = a - b; // b is 4294967295 (-1 gets cast to unsigned)
    b = b + 1; // b is 0 (b was previously the largest unsigned,
               // so adding one circles it back to zero.)
    b += 7;    // b is 7 (+= is shorthand for b = b + 7;
#+end_src

In the above, we've illustrated the use of signed and unsigned 
integer types and the operators between them. It is important to 
take care when you assign a result to a variable that doesn't match 
the type of the result. In many cases, the result gets implicitly 
cast to the type of variable being assigned to. The result may or 
may not match your expectations, as shown above.

** Floating point types
There are two main floating point data types in C++, =float= and =double=,
which correspond to [[https://en.wikipedia.org/wiki/IEEE_floating_point][IEEE 32- and 64-bit floating point types]]. 

#+begin_src cpp -n :tangle src/dtypes/float/main.cpp :exports both :results output
  #include <iostream>
  #include <limits>

  int main() {
    float a; //  Declare a single precision float.
    double b; // Declare a double precision float.

    // Print the max value of a float type.
    std::cout << std::numeric_limits<float>::max() << std::endl;

    // Print the max value of a double type.
    std::cout << std::numeric_limits<double>::max() << std::endl;

    // Print machine epsilon of a float type.
    std::cout << std::numeric_limits<float>::epsilon() << std::endl;

    // Print machine epsilon of a double type.
    std::cout << std::numeric_limits<double>::epsilon() << std::endl;

    return 0;
  }
#+end_src

#+RESULTS[654068c6d84db6c255469f8810f846be9a6cc34a]:
: 3.40282e+38
: 1.79769e+308
: 1.19209e-07
: 2.22045e-16

** Casting

Sometimes it is useful to explicitly cast one variable type as another. 
This can be done like the following:

#+begin_src cpp -n :includes <iostream> :exports both :output results :tangle src/dtypes/casting/main.cpp
  int a; double b = 3.14159;

  a = (int) b;

  std::cout << a << std::endl;
#+end_src

#+RESULTS[accfd981d512e31a619201c89ee4b411343f389b]:
: 3

** The =const= modifier

If the value of some variable should not change, you can use the =const=
keyword to protect its status. It is typical to denote =const= variables 
with all caps. Try to compile the following program:

#+begin_src cpp -n :tangle src/dtypes/const/main.cpp
  const double PI = 3.14159;

  PI = 3.0;
#+end_src

#+RESULTS[0d6309bd59e8e0a5e714b688d8de858846cc1301]:

You will see an error like, =error: assignment of read-only variable ‘PI’=. 

