resources/langs/cpp/index.html

<div id="outline-container-2.3" class="outline-3">
<h3 id="sec-2.3">2.3 Writing a program </h3>
<div id="text-2.3">


<p>
Let's create our first C++ program, the obligatory "Hello, world!". First, 
fire-up your text editor and create a file called, <code>hello.cpp</code>, with the 
following contents:
</p>



<pre class="example">
<span class="linenr">1:  </span>  #include &lt;iostream&gt;
<span class="linenr">2:  </span>
<span class="linenr">3:  </span>  int main() {
<span class="linenr">4:  </span>    std::cout &lt;&lt; "Hello, world!";
<span class="linenr">5:  </span>    return 0;
<span class="linenr">6:  </span>  }
</pre>




<p>
Now, to compile the program, execute:
</p>



<pre class="example">
  g++ hello.cpp
</pre>





<p>
Followed by:
</p>


<pre class="example">
  ./a.out
</pre>




<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<col align="left"></col><col align="left"></col>
<tbody>
<tr><td>Hello</td><td>world!</td></tr>
</tbody>
</table>


<p>
By default, <code>g++</code> names the resulting binary executable, <code>a.out</code>, but
you can specify a different output file name by using the <code>-o</code> flag:
</p>



<pre class="example">
  g++ hello.cpp -o my_executable_file.bin
</pre>





<p>
Note that in Windows, executable files typically end in <code>.exe</code>. In Unix-like
systems, there is no particular file-extension type for executables.
</p>
</div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3">3 Data types </h2>
<div id="text-3">

<p>As we <a href="#sec-1.1">mentioned previously</a>, you must explicitly declare the type of a 
variable. So, in this section, we'll talk about the main variable 
types you'll use. In the section on <a href="#sec-1.1">object-oriented programming</a>, 
we'll discuss how to build more complex data types.
</p>

</div>

<div id="outline-container-3.1" class="outline-3">
<h3 id="sec-3.1">3.1 The <code>bool</code> type </h3>
<div id="text-3.1">

<p>A boolean data type is either <code>true</code> or <code>false</code>. There are a number of 
operators between these types, illustrated in the code snippet below 
(note that lines starting with <code>//</code> are comments and are ignored by the 
compiler):
</p>



<pre class="example">
<span class="linenr"> 1:  </span>  bool a,b,c; // Declare the type of variables a, b, and c.
<span class="linenr"> 2:  </span>  a = true;
<span class="linenr"> 3:  </span>  b = false;
<span class="linenr"> 4:  </span>
<span class="linenr"> 5:  </span>  // !  is logical negation when applied to a single variable.
<span class="linenr"> 6:  </span>  c = !a; // c is false.
<span class="linenr"> 7:  </span>
<span class="linenr"> 8:  </span>  // &amp;&amp; is logical and.
<span class="linenr"> 9:  </span>  c = (a &amp;&amp; b); // c is false.
<span class="linenr">10:  </span>
<span class="linenr">11:  </span>  // || is logical or.
<span class="linenr">12:  </span>  c = (a || b); // c is true.
</pre>




<p>
We don't often use boolean variables by themselves, but rather as a result 
of comparing two other data types (such as comparing if one integer is less 
than another integer). Expressions that result in boolean values are mostly 
used in <a href="#sec-4.1">conditional control structures</a>.
</p>
</div>

</div>

<div id="outline-container-3.2" class="outline-3">
<h3 id="sec-3.2">3.2 <code>int</code> types </h3>
<div id="text-3.2">


<p>
There are <a href="http://en.cppreference.com/w/cpp/language/types">a variety of integer types</a> in C++. Below, we illustrate a 
couple. These can be modified further using the <code>short</code> and <code>long</code> 
keywords, changing the number of bytes occupied by the variable (and 
hence the maximum and minimum size the variable can take on).
</p>



<pre class="example">
<span class="linenr"> 1:  </span>    int a = 6; // initialize a to 6.
<span class="linenr"> 2:  </span>    unsigned int b = 7; // initialize b to 7.
<span class="linenr"> 3:  </span>    int c; // declare c to be an integer variable.
<span class="linenr"> 4:  </span>
<span class="linenr"> 5:  </span>    a = 6;
<span class="linenr"> 6:  </span>    b = 7;
<span class="linenr"> 7:  </span>
<span class="linenr"> 8:  </span>    c = a / b; // c is 0
<span class="linenr"> 9:  </span>    c = b / a; // c is 1
<span class="linenr">10:  </span>    c = b % a; // c is 1 (% is the integer remainder or modulo operator)
<span class="linenr">11:  </span>    c = a - b; // c is -1
<span class="linenr">12:  </span>    c = a &gt; b; // c is 0 (boolean gets cast to integer)
<span class="linenr">13:  </span>    c = a &lt; b; // c is 1 (boolean gets cast to integer)
<span class="linenr">14:  </span>    c++;       // c is 2 (++ is shorthand for c = c + 1)
<span class="linenr">15:  </span>
<span class="linenr">16:  </span>    b = a - b; // b is 4294967295 (-1 gets cast to unsigned)
<span class="linenr">17:  </span>    b = b + 1; // b is 0 (b was previously the largest unsigned,
<span class="linenr">18:  </span>               // so adding one circles it back to zero.)
<span class="linenr">19:  </span>    b += 7;    // b is 7 (+= is shorthand for b = b + 7;
</pre>




<p>
In the above, we've illustrated the use of signed and unsigned 
integer types and the operators between them. It is important to 
take care when you assign a result to a variable that doesn't match 
the type of the result. In many cases, the result gets implicitly 
cast to the type of variable being assigned to. The result may or 
may not match your expectations, as shown above.
</p>
</div>

</div>

<div id="outline-container-3.3" class="outline-3">
<h3 id="sec-3.3">3.3 Floating point types </h3>
<div id="text-3.3">

<p>There are two main floating point data types in C++, <code>float</code> and <code>double</code>,
which correspond to <a href="https://en.wikipedia.org/wiki/IEEE_floating_point">IEEE 32- and 64-bit floating point types</a>. 
</p>



<pre class="example">
<span class="linenr"> 1:  </span>  #include &lt;iostream&gt;
<span class="linenr"> 2:  </span>  #include &lt;limits&gt;
<span class="linenr"> 3:  </span>
<span class="linenr"> 4:  </span>  int main() {
<span class="linenr"> 5:  </span>    float a; //  Declare a single precision float.
<span class="linenr"> 6:  </span>    double b; // Declare a double precision float.
<span class="linenr"> 7:  </span>
<span class="linenr"> 8:  </span>    // Print the max value of a float type.
<span class="linenr"> 9:  </span>    std::cout &lt;&lt; std::numeric_limits&lt;float&gt;::max() &lt;&lt; std::endl;
<span class="linenr">10:  </span>
<span class="linenr">11:  </span>    // Print the max value of a double type.
<span class="linenr">12:  </span>    std::cout &lt;&lt; std::numeric_limits&lt;double&gt;::max() &lt;&lt; std::endl;
<span class="linenr">13:  </span>
<span class="linenr">14:  </span>    // Print machine epsilon of a float type.
<span class="linenr">15:  </span>    std::cout &lt;&lt; std::numeric_limits&lt;float&gt;::epsilon() &lt;&lt; std::endl;
<span class="linenr">16:  </span>
<span class="linenr">17:  </span>    // Print machine epsilon of a double type.
<span class="linenr">18:  </span>    std::cout &lt;&lt; std::numeric_limits&lt;double&gt;::epsilon() &lt;&lt; std::endl;
<span class="linenr">19:  </span>
<span class="linenr">20:  </span>    return 0;
<span class="linenr">21:  </span>  }
</pre>




: 3.40282e+38
: 1.79769e+308
: 1.19209e-07
: 2.22045e-16

</div>

</div>

<div id="outline-container-3.4" class="outline-3">
<h3 id="sec-3.4">3.4 Casting </h3>
<div id="text-3.4">


<p>
Sometimes it is useful to explicitly cast one variable type as another. 
This can be done like the following:
</p>



<pre class="example">
<span class="linenr">1:  </span>  int a; double b = 3.14159;
<span class="linenr">2:  </span>
<span class="linenr">3:  </span>  a = (int) b;
<span class="linenr">4:  </span>
<span class="linenr">5:  </span>  std::cout &lt;&lt; a &lt;&lt; std::endl;
</pre>




: 3

</div>

</div>

<div id="outline-container-3.5" class="outline-3">
<h3 id="sec-3.5">3.5 The <code>const</code> modifier </h3>
<div id="text-3.5">


<p>
If the value of some variable should not change, you can use the <code>const</code>
keyword to protect its status. It is typical to denote <code>const</code> variables 
with all caps. Try to compile the following program:
</p>



<pre class="example">
<span class="linenr">1:  </span>  const double PI = 3.14159;
<span class="linenr">2:  </span>
<span class="linenr">3:  </span>  PI = 3.0;
</pre>





<p>
You will see an error like, <code>error: assignment of read-only variable ‘PI’</code>. 
</p>
</div>

</div>
