resources/langs/cpp/index.org
** The =typedef= keyword
Suppose you have a large numerical experiment, where all your code used 
floating point of type =double=. Your curious about how the results will 
be affected by changing the floating point type to single precision =float=
type. One solution would be to run a "find and replace" in your editor, but 
something about that doesn't feel right.

Instead, we can use the =typedef= statement to define types:

#+begin_src cpp -n :tangle src/dtypes/typedef/main.cpp
  // Define "int_type" to be a short int.
  typedef short int int_type;

  // Define "float_type" to be single precision float.
  typedef float float_type;

  // Define "array_index_type" to be unsigned long int.
  typedef unsigned long int array_index_type;

  int_type a = -17; 
  float_type b = 1.14; 
  array_index_type c = 9;
#+end_src

#+RESULTS:

** Pointers and references
*** Pointers
Pointers are variables that hold the *memory address* for a variable 
of a specific type. Pointers are declared by specifying the variable 
type, followed by the =*= symbol, followed by the name of the pointer 
variable, e.g., =double * x= defines a "pointer to double" variable. 
The variable, =x=, therefore, does not hold the value of a =double= 
type, but rather, the memory address for a variable of type, =double=.
The memory address for a variable can be obtained by the =&= operator.

#+begin_src cpp -n :exports both :results output :includes <iostream> :tangle src/dtypes/pointers/main1.cpp
  double * a;
  double b = 7;
  
  // This obtains the memory address of `b`.
  a = &b;
  
  // Prints some memory address (starts with 0x)
  std::cout << a << std::endl;
#+end_src

#+RESULTS[2fdeaa25980d5084736b0b9ed6298c0a2b21f3f6]:
: 0x7ffe0d98f7b8

Similar to obtaining the memory address from a regular variable, using the
=&= operator, you can use the =*= symbol before a pointer to access the 
variable value held at the memory location of the pointer. In this context,
the =*= symbol is called the *dereference operator*. This is probably better 
understood with a short example:

#+begin_src cpp -n :includes <iostream> :exports both :results output :tangle src/dtypes/pointers/main2.cpp
  double * a;
  double b = 7.3;
  double c;

  // Now `a` holds the memory address of `b`.
  a = &b;

  // `*a` obtains the value of the variable
  // at the memory address held by `a`.
  // So, `c` is 7.3.
  c = *a;

  std::cout << c << "\n";
#+end_src

#+RESULTS[4faba160c0ff0d4f8e2103ca9ae5fa00c1c3c6dc]:
: 7.3

*** References

A reference is a sort of like a pointer, but not quite. [[https://en.wikipedia.org/wiki/Reference_(C%2B%2B)][There are differences]].
A good analogy, which you can find in the previous link, is that a reference
is similar to a symbolic link, or "shortcut" if you're on Windows. You can 
treat it more-or-less like the original variable, but it's not the original.

#+begin_src cpp -n :includes <iostream> :exports both :results output src/dtypes/references/main.cpp
  double a = 1.1;
  // `b` is a reference to `a`.
  double & b = a;

  std::cout << "a: " << a << ", b: " << b << "\n";

  a = 2.1;

  std::cout << "a: " << a << ", b: " << b << "\n";

  b = 3.1;

  std::cout << "a: " << a << ", b: " << b << "\n";

  std::cout << "\n\n";
  std::cout << "&a: " << &a << "\n" << "&b: " << &b << "\n";
#+end_src

#+RESULTS[fca20756bf8fb0aa7033917d1f8cf51ef1d8f659]:
: a: 1.1, b: 1.1
: a: 2.1, b: 2.1
: a: 3.1, b: 3.1
: 
: 
: &a: 0x7ffcfbe7b1e8
: &b: 0x7ffcfbe7b1e8

References are useful for passing around large objects, so that the object
doesn't need to be copied. References are also useful as a return type for 
functions [[Functions][(to be discussed later)]] because it allows to assign to assign a 
value to a function, which is useful if the function, for example, returns 
a reference to the element of an array.

** Arrays
The length of an array can be fixed or dynamic, and how you
declare the array depends on this. Array indexing starts at 0 in C++ 
(compared to start at 1, for example, in Fortran or Matlab).

*** Fixed length arrays
#+begin_src cpp -n :tangle src/dtypes/arrays/fixed.cpp
double a[5];

a[0] = 1.0;
// etc.
#+end_src

#+RESULTS[9acd5efc944280def09a7d443465f861a00f28a6]:

*** Dynamic length arrays
Dynamic length arrays are made possible through pointers:

#+begin_src cpp -n :tangle src/dtypes/arrays/dynamic.cpp
  // This allocates memory for 5 double types.
  double * a = new double[5];

  // Afterwards, you can treat `a` like a normal array.
  a[0] = 1.0;
  // etc...

  // Whenever you use the `new` keyword, you must
  // delete the memory allocated when you're done by hand.
  delete [] a;

  // We can change the size of `a`.
  a = new double [10];

  a[0] = 2.0;
  // etc...

  delete [] a;
#+end_src

#+RESULTS[99c12b3b1f8910dea8d9f6b702187269bfa0d918]:

Note that omitting the first =delete= statement will cause no error. 
However, the memory allocated by the first =new= statement will not 
be freed, and thus inaccessible. This is bad because the memory cannot 
be allocated to other resources. You should generally try to avoid 
manually memory management when possible, but a good tool for debugging 
memory problems is called [[http://valgrind.org/][valgrind]]. 

#+RESULTS:

* Control structures
** Conditionals
