resources/langs/cpp/index.html

<div id="outline-container-3.6" class="outline-3">
<h3 id="sec-3.6">3.6 The <code>typedef</code> keyword </h3>
<div id="text-3.6">

<p>Suppose you have a large numerical experiment, where all your code used 
floating point of type <code>double</code>. Your curious about how the results will 
be affected by changing the floating point type to single precision <code>float</code>
type. One solution would be to run a "find and replace" in your editor, but 
something about that doesn't feel right.
</p>
<p>
Instead, we can use the <code>typedef</code> statement to define types:
</p>



<pre class="example">
<span class="linenr"> 1:  </span>  // Define "int_type" to be a short int.
<span class="linenr"> 2:  </span>  typedef short int int_type;
<span class="linenr"> 3:  </span>
<span class="linenr"> 4:  </span>  // Define "float_type" to be single precision float.
<span class="linenr"> 5:  </span>  typedef float float_type;
<span class="linenr"> 6:  </span>
<span class="linenr"> 7:  </span>  // Define "array_index_type" to be unsigned long int.
<span class="linenr"> 8:  </span>  typedef unsigned long int array_index_type;
<span class="linenr"> 9:  </span>
<span class="linenr">10:  </span>  int_type a = -17; 
<span class="linenr">11:  </span>  float_type b = 1.14; 
<span class="linenr">12:  </span>  array_index_type c = 9;
</pre>





</div>

</div>

<div id="outline-container-3.7" class="outline-3">
<h3 id="sec-3.7">3.7 Pointers and references </h3>
<div id="text-3.7">


</div>

<div id="outline-container-3.7.1" class="outline-4">
<h4 id="sec-3.7.1">3.7.1 Pointers </h4>
<div id="text-3.7.1">

<p>Pointers are variables that hold the <b>memory address</b> for a variable 
of a specific type. Pointers are declared by specifying the variable 
type, followed by the <code>*</code> symbol, followed by the name of the pointer 
variable, e.g., <code>double * x</code> defines a "pointer to double" variable. 
The variable, <code>x</code>, therefore, does not hold the value of a <code>double</code> 
type, but rather, the memory address for a variable of type, <code>double</code>.
The memory address for a variable can be obtained by the <code>&amp;</code> operator.
</p>



<pre class="example">
<span class="linenr">1:  </span>  double * a;
<span class="linenr">2:  </span>  double b = 7;
<span class="linenr">3:  </span>  
<span class="linenr">4:  </span>  // This obtains the memory address of `b`.
<span class="linenr">5:  </span>  a = &amp;b;
<span class="linenr">6:  </span>  
<span class="linenr">7:  </span>  // Prints some memory address (starts with 0x)
<span class="linenr">8:  </span>  std::cout &lt;&lt; a &lt;&lt; std::endl;
</pre>




: 0x7ffe0d98f7b8

<p>
Similar to obtaining the memory address from a regular variable, using the
<code>&amp;</code> operator, you can use the <code>*</code> symbol before a pointer to access the 
variable value held at the memory location of the pointer. In this context,
the <code>*</code> symbol is called the <b>dereference operator</b>. This is probably better 
understood with a short example:
</p>



<pre class="example">
<span class="linenr"> 1:  </span>  double * a;
<span class="linenr"> 2:  </span>  double b = 7.3;
<span class="linenr"> 3:  </span>  double c;
<span class="linenr"> 4:  </span>
<span class="linenr"> 5:  </span>  // Now `a` holds the memory address of `b`.
<span class="linenr"> 6:  </span>  a = &amp;b;
<span class="linenr"> 7:  </span>
<span class="linenr"> 8:  </span>  // `*a` obtains the value of the variable
<span class="linenr"> 9:  </span>  // at the memory address held by `a`.
<span class="linenr">10:  </span>  // So, `c` is 7.3.
<span class="linenr">11:  </span>  c = *a;
<span class="linenr">12:  </span>
<span class="linenr">13:  </span>  std::cout &lt;&lt; c &lt;&lt; "\n";
</pre>




: 7.3

</div>

</div>

<div id="outline-container-3.7.2" class="outline-4">
<h4 id="sec-3.7.2">3.7.2 References </h4>
<div id="text-3.7.2">


<p>
A reference is a sort of like a pointer, but not quite. <a href="https://en.wikipedia.org/wiki/Reference_(C++)">There are differences</a>.
A good analogy, which you can find in the previous link, is that a reference
is similar to a symbolic link, or "shortcut" if you're on Windows. You can 
treat it more-or-less like the original variable, but it's not the original.
</p>



<pre class="example">
<span class="linenr"> 1:  </span>  double a = 1.1;
<span class="linenr"> 2:  </span>  // `b` is a reference to `a`.
<span class="linenr"> 3:  </span>  double &amp; b = a;
<span class="linenr"> 4:  </span>
<span class="linenr"> 5:  </span>  std::cout &lt;&lt; "a: " &lt;&lt; a &lt;&lt; ", b: " &lt;&lt; b &lt;&lt; "\n";
<span class="linenr"> 6:  </span>
<span class="linenr"> 7:  </span>  a = 2.1;
<span class="linenr"> 8:  </span>
<span class="linenr"> 9:  </span>  std::cout &lt;&lt; "a: " &lt;&lt; a &lt;&lt; ", b: " &lt;&lt; b &lt;&lt; "\n";
<span class="linenr">10:  </span>
<span class="linenr">11:  </span>  b = 3.1;
<span class="linenr">12:  </span>
<span class="linenr">13:  </span>  std::cout &lt;&lt; "a: " &lt;&lt; a &lt;&lt; ", b: " &lt;&lt; b &lt;&lt; "\n";
<span class="linenr">14:  </span>
<span class="linenr">15:  </span>  std::cout &lt;&lt; "\n\n";
<span class="linenr">16:  </span>  std::cout &lt;&lt; "&amp;a: " &lt;&lt; &amp;a &lt;&lt; "\n" &lt;&lt; "&amp;b: " &lt;&lt; &amp;b &lt;&lt; "\n";
</pre>




: a: 1.1, b: 1.1
: a: 2.1, b: 2.1
: a: 3.1, b: 3.1
: 
: 
: &a: 0x7ffcfbe7b1e8
: &b: 0x7ffcfbe7b1e8

<p>
References are useful for passing around large objects, so that the object
doesn't need to be copied. References are also useful as a return type for 
functions <a href="#sec-3.7.2">(to be discussed later)</a> because it allows to assign to assign a 
value to a function, which is useful if the function, for example, returns 
a reference to the element of an array.
</p>
</div>
</div>

</div>

<div id="outline-container-3.8" class="outline-3">
<h3 id="sec-3.8">3.8 Arrays </h3>
<div id="text-3.8">

<p>The length of an array can be fixed or dynamic, and how you
declare the array depends on this. Array indexing starts at 0 in C++ 
(compared to start at 1, for example, in Fortran or Matlab).
</p>

</div>

<div id="outline-container-3.8.1" class="outline-4">
<h4 id="sec-3.8.1">3.8.1 Fixed length arrays </h4>
<div id="text-3.8.1">




<pre class="example">
<span class="linenr">1:  </span>double a[5];
<span class="linenr">2:  </span>
<span class="linenr">3:  </span>a[0] = 1.0;
<span class="linenr">4:  </span>// etc.
</pre>





</div>

</div>

<div id="outline-container-3.8.2" class="outline-4">
<h4 id="sec-3.8.2">3.8.2 Dynamic length arrays </h4>
<div id="text-3.8.2">

<p>Dynamic length arrays are made possible through pointers:
</p>



<pre class="example">
<span class="linenr"> 1:  </span>  // This allocates memory for 5 double types.
<span class="linenr"> 2:  </span>  double * a = new double[5];
<span class="linenr"> 3:  </span>
<span class="linenr"> 4:  </span>  // Afterwards, you can treat `a` like a normal array.
<span class="linenr"> 5:  </span>  a[0] = 1.0;
<span class="linenr"> 6:  </span>  // etc...
<span class="linenr"> 7:  </span>
<span class="linenr"> 8:  </span>  // Whenever you use the `new` keyword, you must
<span class="linenr"> 9:  </span>  // delete the memory allocated when you're done by hand.
<span class="linenr">10:  </span>  delete [] a;
<span class="linenr">11:  </span>
<span class="linenr">12:  </span>  // We can change the size of `a`.
<span class="linenr">13:  </span>  a = new double [10];
<span class="linenr">14:  </span>
<span class="linenr">15:  </span>  a[0] = 2.0;
<span class="linenr">16:  </span>  // etc...
<span class="linenr">17:  </span>
<span class="linenr">18:  </span>  delete [] a;
</pre>





<p>
Note that omitting the first <code>delete</code> statement will cause no error. 
However, the memory allocated by the first <code>new</code> statement will not 
be freed, and thus inaccessible. This is bad because the memory cannot 
be allocated to other resources. You should generally try to avoid 
manually memory management when possible, but a good tool for debugging 
memory problems is called <a href="http://valgrind.org/">valgrind</a>. 
</p>

</div>
</div>
</div>

</div>
