resources/langs/cpp/index.org
*** Example: =if= / =else= and random number generation
Often a code block should only be executed if some condition is true. 
Below, we generate a random number between 0 and 1; print the number; and,
print whether or not the number was greater than 0.5.

#+begin_src cpp -n :exports both :results output :tangle src/conditionals/ifelse/main.cpp
  #include <iostream>
  #include <stdlib.h>
  #include <time.h>

  int main() {
    // Seed a random number generator.
    srand(123);

    // rand() produces a random integer between 0 and RAND_MAX.
    double num = rand() / ((double) RAND_MAX);

    std::cout << "num: " << num << "\n";

    if (num < 0.5) {
      std::cout << "num was less than 0.5.\n";
    }
    else {
      std::cout << "num was greater than 0.5.\n";
    }

    // Do it again.
    num = rand() / ((double) RAND_MAX);

    std::cout << "num: " << num << "\n";

    if (num < 0.5) {
      std::cout << "num was less than 0.5.\n";
    }
    else {
      std::cout << "num was greater than 0.5.\n";
    }

    return 0;
  }
#+end_src

#+RESULTS[89e0babb392b5cd36e346b57da6e76ba39cea3cf]:
: num: 0.0600514
: num was less than 0.5.
: num: 0.788318
: num was greater than 0.5.

*** Example: =if= / =else if= / =else=

You can follow =else= immediate by another =if= to have multiple mutually-
exclusive blocks:

#+begin_src cpp -n :exports both :results output :tangle src/conditionals/elif/main.cpp
  #include <iostream>
  #include <stdlib.h>
  #include <time.h>

  int main() {
    // Seed the random number generator based on the current time.
    srand(time(NULL));

    // rand() produces a random integer between 0 and RAND_MAX.
    double num = rand() / ((double) RAND_MAX);

    std::cout << "num: " << num << "\n";

    if (num >= 0.75) {
      std::cout << "num was between 0.75 and 1.\n";
    }
    else if (num >= 0.5) {
      std::cout << "num was between 0.5 and 0.75.";
    }
    else if (num >= 0.25) {
      std::cout << "num was between 0.25 and 0.5.";
    }
    else {
      std::cout << "num was between 0 and 0.25";
    }

    return 0;
  }
#+end_src

#+RESULTS[014df5b5413cb63ddbba75f173c7008595bdf56a]:
: num: 0.0456405
: num was between 0 and 0.25

The conditions are checked in the order that they're written. So, for example,
in the second condition, we don't need to specify ~num >= 0.5 && num < 0.75~ 
because we know that this condition will only be checked if the previous 
was false.

** Loops
We discuss two main structures for iterating -- the =for= and =while= loops.
*** The =for= loop
The =for= loop requires three specifications -- the iteration variable 
initialization, the termination condition, and the update rule. The body
of the loop follows these three specifications. Shown below, we declare 
an array; assign to its components; and, print the current component to 
the screen.

#+begin_src cpp -n :includes <iostream> :results output :exports both :tangle src/loops/for/linspace.cpp
  int length = 11;
  double x[length];

  for(int i=0; i < length; i++) {
    // Assign to each array component.
    x[i] = (double) i / (length - 1);

    // Print the current component.
    std::cout << "x[" << i << "] = " << x[i] << std::endl;
  }
#+end_src

#+RESULTS[877d922a085062a38d850eb283cf7b918cdd88aa]:
#+begin_example
x[0] = 0
x[1] = 0.1
x[2] = 0.2
x[3] = 0.3
x[4] = 0.4
x[5] = 0.5
x[6] = 0.6
x[7] = 0.7
x[8] = 0.8
x[9] = 0.9
x[10] = 1
#+end_example


**** Example: row-major matrix

You can nest loops, i.e., loops inside of loops, etc.

Below, is an example of a double loop for creating and accessing 
matrix data stored in a flat array. The matrix data is stored in 
[[https://en.wikipedia.org/wiki/Row-major-order][row-major order]]. This means the first =n_cols= elements of the 
array named, =matrix=, will contain the first row of the matrix, 
the second =n_cols= elements of =matrix= will contain the second row, etc.

#+begin_src cpp -n :includes <iostream> :exports both :results output :tangle src/loops/for/flat-matrix.cpp
  int n_rows = 4;
  int n_cols = 3;

  // Row-major matrix array.
  double matrix [n_rows*n_cols];

  // temporary index.
  int k;

  for(int i=0; i < n_rows; i++) {
    for(int j=0; j < n_cols; j++) {
      // Convert the (i,j) matrix index to the "flat" row-major index.
      k = i*n_cols + j;

      // Assign a value of 1.0 to the diagonal,
      // 2 to the off-diagonal, and 0 otherwise.
      if (i == j) {
        matrix[k] = 1.0;
      }
      else if ((i == (j+1)) || (i == (j-1))){
        matrix[k] = 2.0;
      }
      else {
        matrix[k] = 0.0;
      }
    }
  }


  // Print the matrix elements.
  for(int i=0; i < n_rows; i++) {
    for(int j=0; j < n_cols; j++) {
      k = i*n_cols + j;

      std::cout << matrix[k];
      if (j != (n_cols-1)) {
        std::cout << ", ";
      }
    }

    if (i != (n_rows-1)) {
      std::cout << "\n";
    }
  }
#+end_src

#+RESULTS[453eb42cd8778bde63505600cd96e4583975b649]:
: 1, 2, 0
: 2, 1, 2
: 0, 2, 1
: 0, 0, 2

*** The =while= loop
A =while= loop iterates while a condition is =true=. Essentially, it is a =for=
loop without an update variable.

