resources/langs/cpp/index.html

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4">4 Control structures </h2>
<div id="text-4">


</div>

<div id="outline-container-4.1" class="outline-3">
<h3 id="sec-4.1">4.1 Conditionals </h3>
<div id="text-4.1">


</div>

<div id="outline-container-4.1.1" class="outline-4">
<h4 id="sec-4.1.1">4.1.1 Example: <code>if</code> / <code>else</code> and random number generation </h4>
<div id="text-4.1.1">

<p>Often a code block should only be executed if some condition is true. 
Below, we generate a random number between 0 and 1; print the number; and,
print whether or not the number was greater than 0.5.
</p>



<pre class="example">
<span class="linenr"> 1:  </span>  #include &lt;iostream&gt;
<span class="linenr"> 2:  </span>  #include &lt;stdlib.h&gt;
<span class="linenr"> 3:  </span>  #include &lt;time.h&gt;
<span class="linenr"> 4:  </span>
<span class="linenr"> 5:  </span>  int main() {
<span class="linenr"> 6:  </span>    // Seed a random number generator.
<span class="linenr"> 7:  </span>    srand(123);
<span class="linenr"> 8:  </span>
<span class="linenr"> 9:  </span>    // rand() produces a random integer between 0 and RAND_MAX.
<span class="linenr">10:  </span>    double num = rand() / ((double) RAND_MAX);
<span class="linenr">11:  </span>
<span class="linenr">12:  </span>    std::cout &lt;&lt; "num: " &lt;&lt; num &lt;&lt; "\n";
<span class="linenr">13:  </span>
<span class="linenr">14:  </span>    if (num &lt; 0.5) {
<span class="linenr">15:  </span>      std::cout &lt;&lt; "num was less than 0.5.\n";
<span class="linenr">16:  </span>    }
<span class="linenr">17:  </span>    else {
<span class="linenr">18:  </span>      std::cout &lt;&lt; "num was greater than 0.5.\n";
<span class="linenr">19:  </span>    }
<span class="linenr">20:  </span>
<span class="linenr">21:  </span>    // Do it again.
<span class="linenr">22:  </span>    num = rand() / ((double) RAND_MAX);
<span class="linenr">23:  </span>
<span class="linenr">24:  </span>    std::cout &lt;&lt; "num: " &lt;&lt; num &lt;&lt; "\n";
<span class="linenr">25:  </span>
<span class="linenr">26:  </span>    if (num &lt; 0.5) {
<span class="linenr">27:  </span>      std::cout &lt;&lt; "num was less than 0.5.\n";
<span class="linenr">28:  </span>    }
<span class="linenr">29:  </span>    else {
<span class="linenr">30:  </span>      std::cout &lt;&lt; "num was greater than 0.5.\n";
<span class="linenr">31:  </span>    }
<span class="linenr">32:  </span>
<span class="linenr">33:  </span>    return 0;
<span class="linenr">34:  </span>  }
</pre>




: num: 0.0600514
: num was less than 0.5.
: num: 0.788318
: num was greater than 0.5.

</div>

</div>

<div id="outline-container-4.1.2" class="outline-4">
<h4 id="sec-4.1.2">4.1.2 Example: <code>if</code> / <code>else if</code> / <code>else</code> </h4>
<div id="text-4.1.2">


<p>
You can follow <code>else</code> immediate by another <code>if</code> to have multiple mutually-
exclusive blocks:
</p>



<pre class="example">
<span class="linenr"> 1:  </span>  #include &lt;iostream&gt;
<span class="linenr"> 2:  </span>  #include &lt;stdlib.h&gt;
<span class="linenr"> 3:  </span>  #include &lt;time.h&gt;
<span class="linenr"> 4:  </span>
<span class="linenr"> 5:  </span>  int main() {
<span class="linenr"> 6:  </span>    // Seed the random number generator based on the current time.
<span class="linenr"> 7:  </span>    srand(time(NULL));
<span class="linenr"> 8:  </span>
<span class="linenr"> 9:  </span>    // rand() produces a random integer between 0 and RAND_MAX.
<span class="linenr">10:  </span>    double num = rand() / ((double) RAND_MAX);
<span class="linenr">11:  </span>
<span class="linenr">12:  </span>    std::cout &lt;&lt; "num: " &lt;&lt; num &lt;&lt; "\n";
<span class="linenr">13:  </span>
<span class="linenr">14:  </span>    if (num &gt;= 0.75) {
<span class="linenr">15:  </span>      std::cout &lt;&lt; "num was between 0.75 and 1.\n";
<span class="linenr">16:  </span>    }
<span class="linenr">17:  </span>    else if (num &gt;= 0.5) {
<span class="linenr">18:  </span>      std::cout &lt;&lt; "num was between 0.5 and 0.75.";
<span class="linenr">19:  </span>    }
<span class="linenr">20:  </span>    else if (num &gt;= 0.25) {
<span class="linenr">21:  </span>      std::cout &lt;&lt; "num was between 0.25 and 0.5.";
<span class="linenr">22:  </span>    }
<span class="linenr">23:  </span>    else {
<span class="linenr">24:  </span>      std::cout &lt;&lt; "num was between 0 and 0.25";
<span class="linenr">25:  </span>    }
<span class="linenr">26:  </span>
<span class="linenr">27:  </span>    return 0;
<span class="linenr">28:  </span>  }
</pre>




: num: 0.0456405
: num was between 0 and 0.25

<p>
The conditions are checked in the order that they're written. So, for example,
in the second condition, we don't need to specify <code>num &gt;= 0.5 &amp;&amp; num &lt; 0.75</code> 
because we know that this condition will only be checked if the previous 
was false.
</p>
</div>
</div>

</div>

<div id="outline-container-4.2" class="outline-3">
<h3 id="sec-4.2">4.2 Loops </h3>
<div id="text-4.2">

<p>We discuss two main structures for iterating &ndash; the <code>for</code> and <code>while</code> loops.
</p>
</div>

<div id="outline-container-4.2.1" class="outline-4">
<h4 id="sec-4.2.1">4.2.1 The <code>for</code> loop </h4>
<div id="text-4.2.1">

<p>The <code>for</code> loop requires three specifications &ndash; the iteration variable 
initialization, the termination condition, and the update rule. The body
of the loop follows these three specifications. Shown below, we declare 
an array; assign to its components; and, print the current component to 
the screen.
</p>



<pre class="example">
<span class="linenr"> 1:  </span>  int length = 11;
<span class="linenr"> 2:  </span>  double x[length];
<span class="linenr"> 3:  </span>
<span class="linenr"> 4:  </span>  for(int i=0; i &lt; length; i++) {
<span class="linenr"> 5:  </span>    // Assign to each array component.
<span class="linenr"> 6:  </span>    x[i] = (double) i / (length - 1);
<span class="linenr"> 7:  </span>
<span class="linenr"> 8:  </span>    // Print the current component.
<span class="linenr"> 9:  </span>    std::cout &lt;&lt; "x[" &lt;&lt; i &lt;&lt; "] = " &lt;&lt; x[i] &lt;&lt; std::endl;
<span class="linenr">10:  </span>  }
</pre>





<pre class="example">
x[0] = 0
x[1] = 0.1
x[2] = 0.2
x[3] = 0.3
x[4] = 0.4
x[5] = 0.5
x[6] = 0.6
x[7] = 0.7
x[8] = 0.8
x[9] = 0.9
x[10] = 1
</pre>






</div>

<div id="outline-container-4.2.1.1" class="outline-5">
<h5 id="sec-4.2.1.1">4.2.1.1 Example: row-major matrix </h5>
<div id="text-4.2.1.1">


<p>
You can nest loops, i.e., loops inside of loops, etc.
</p>
<p>
Below, is an example of a double loop for creating and accessing 
matrix data stored in a flat array. The matrix data is stored in 
<a href="https://en.wikipedia.org/wiki/Row-major-order">row-major order</a>. This means the first <code>n_cols</code> elements of the 
array named, <code>matrix</code>, will contain the first row of the matrix, 
the second <code>n_cols</code> elements of <code>matrix</code> will contain the second row, etc.
</p>



<pre class="example">
<span class="linenr"> 1:  </span>  int n_rows = 4;
<span class="linenr"> 2:  </span>  int n_cols = 3;
<span class="linenr"> 3:  </span>
<span class="linenr"> 4:  </span>  // Row-major matrix array.
<span class="linenr"> 5:  </span>  double matrix [n_rows*n_cols];
<span class="linenr"> 6:  </span>
<span class="linenr"> 7:  </span>  // temporary index.
<span class="linenr"> 8:  </span>  int k;
<span class="linenr"> 9:  </span>
<span class="linenr">10:  </span>  for(int i=0; i &lt; n_rows; i++) {
<span class="linenr">11:  </span>    for(int j=0; j &lt; n_cols; j++) {
<span class="linenr">12:  </span>      // Convert the (i,j) matrix index to the "flat" row-major index.
<span class="linenr">13:  </span>      k = i*n_cols + j;
<span class="linenr">14:  </span>
<span class="linenr">15:  </span>      // Assign a value of 1.0 to the diagonal,
<span class="linenr">16:  </span>      // 2 to the off-diagonal, and 0 otherwise.
<span class="linenr">17:  </span>      if (i == j) {
<span class="linenr">18:  </span>        matrix[k] = 1.0;
<span class="linenr">19:  </span>      }
<span class="linenr">20:  </span>      else if ((i == (j+1)) || (i == (j-1))){
<span class="linenr">21:  </span>        matrix[k] = 2.0;
<span class="linenr">22:  </span>      }
<span class="linenr">23:  </span>      else {
<span class="linenr">24:  </span>        matrix[k] = 0.0;
<span class="linenr">25:  </span>      }
<span class="linenr">26:  </span>    }
<span class="linenr">27:  </span>  }
<span class="linenr">28:  </span>
<span class="linenr">29:  </span>
<span class="linenr">30:  </span>  // Print the matrix elements.
<span class="linenr">31:  </span>  for(int i=0; i &lt; n_rows; i++) {
<span class="linenr">32:  </span>    for(int j=0; j &lt; n_cols; j++) {
<span class="linenr">33:  </span>      k = i*n_cols + j;
<span class="linenr">34:  </span>
<span class="linenr">35:  </span>      std::cout &lt;&lt; matrix[k];
<span class="linenr">36:  </span>      if (j != (n_cols-1)) {
<span class="linenr">37:  </span>        std::cout &lt;&lt; ", ";
<span class="linenr">38:  </span>      }
<span class="linenr">39:  </span>    }
<span class="linenr">40:  </span>
<span class="linenr">41:  </span>    if (i != (n_rows-1)) {
<span class="linenr">42:  </span>      std::cout &lt;&lt; "\n";
<span class="linenr">43:  </span>    }
<span class="linenr">44:  </span>  }
</pre>




: 1, 2, 0
: 2, 1, 2
: 0, 2, 1
: 0, 0, 2

</div>
</div>

</div>

<div id="outline-container-4.2.2" class="outline-4">
<h4 id="sec-4.2.2">4.2.2 The <code>while</code> loop </h4>
<div id="text-4.2.2">

<p>A <code>while</code> loop iterates while a condition is <code>true</code>. Essentially, it is a <code>for</code>
loop without an update variable.
</p>

</div>
