resources/langs/cpp/index.org
**** Example: truncated sum
In the following example, we approximate the geometric series:

$$
1 = \sum_{n=1}^{\infty} \left(\frac{1}{2}\right)^n
$$

The loop exits when the absolute error, 

$$
    \text{absolute error} := 1-\sum_{n=1}^N  \left(\frac{1}{2}\right)^n
$$

is less than some specified tolerance, =tol=.

#+begin_src cpp -n :includes <iostream> <cstdio> :exports both :results output :tangle src/loops/while/sum/main.cpp
  double sum = 0.0;
  double base = 0.5;
  double pow = base; // initialize to base^1
  double tol = 1e-4;
  int iter = 1;

  while((1-sum) >= tol) {
    // Add `pow` to `sum`.
    sum += pow;
    // Update `pow` by one power of `base`.
    pow *= base;

    printf("Iter: %03d, Sum: %.5f, Abs Err: %.5f\n", iter, sum, 1-sum); 

    // Update the `iter` val by 1.
    iter += 1;
  }
#+end_src

#+RESULTS[961ac44668fff1b00dd0f83d5f9512ccea7effcf]:
#+begin_example
Iter: 001, Sum: 0.50000, Abs Err: 0.50000
Iter: 002, Sum: 0.75000, Abs Err: 0.25000
Iter: 003, Sum: 0.87500, Abs Err: 0.12500
Iter: 004, Sum: 0.93750, Abs Err: 0.06250
Iter: 005, Sum: 0.96875, Abs Err: 0.03125
Iter: 006, Sum: 0.98438, Abs Err: 0.01562
Iter: 007, Sum: 0.99219, Abs Err: 0.00781
Iter: 008, Sum: 0.99609, Abs Err: 0.00391
Iter: 009, Sum: 0.99805, Abs Err: 0.00195
Iter: 010, Sum: 0.99902, Abs Err: 0.00098
Iter: 011, Sum: 0.99951, Abs Err: 0.00049
Iter: 012, Sum: 0.99976, Abs Err: 0.00024
Iter: 013, Sum: 0.99988, Abs Err: 0.00012
Iter: 014, Sum: 0.99994, Abs Err: 0.00006
#+end_example

**** Example: estimating machine epsilon

#+begin_src cpp -n :includes <iostream> <limits> :exports both :results output :tangle src/loops/while/macheps/main.cpp
  double eps = 1;
  int count = 1;

  while(1.0 + eps*0.5 > 1.0) {
      eps *= 0.5;
      count += 1;
  }

  std::cout << eps << ", " << std::numeric_limits<double>::epsilon() << "\n"
            << count << ", " << std::numeric_limits<double>::digits;
#+end_src

#+RESULTS[c3a7af7b2d8705da49b720904d1ca6e52a38c76c]:
: 2.22045e-16, 2.22045e-16
: 53, 53

*** The =break= keyword
The =break= keyword provides a mechanism for exiting the direct parent loop
for which the =break= statement is placed. For example:

#+begin_src cpp -n :results output :exports both :includes <iostream> :tangle src/loops/break/main.cpp
  for(int i=0; i < 3; i++) {
    while(true) {
      std::cout << "Entering infinite loop number " << (i+1) << "\n";
      break;
    }
    std::cout << "We escaped the infinite loop!\n";
  }
#+end_src

#+RESULTS[5a9e1b5a8e6ead2c157283224afe0ac32cde0aec]:
: Entering infinite loop number 1
: We escaped the infinite loop!
: Entering infinite loop number 2
: We escaped the infinite loop!
: Entering infinite loop number 3
: We escaped the infinite loop!

The previous example is contrived, but there are situations, where you
might find the break statement within an infinite loop useful. Of course,
you should avoid this sort of thing if there is a more straight-forward 
approach.

** COMMENT Exercises
1. Given integers, $n$ and $k$, write a program to compute the binomial coefficient, $\displaystyle {n \choose k}$.
2. The series, $\displaystyle \sum_{n=1}^{\infty} \frac{1}{n^2}$, converges to $\displaystyle\frac{\pi^2}{6}$. Create a program that approximates this series up to some specified tolerance, printing the absolute error at each iteration.
3. Fix numbers, $a$ and $b$. Let $x_0 = a$ and $x_N=b$. Let $\Delta x = \frac{b-a}{N}$ and $x_i = a + i \cdot \Delta x$, for $i = 0, 1, \ldots, N$. The left endpoint Riemann sum approximation to the integral, $\displaystyle\int_a^b x^2 dx$, is given by $\displaystyle\sum_{n=1}^N (x_i)^2 \Delta x$. Write a program with $a=0$ and $b=1$, which successively halves $\Delta x$ (starting from the initial value of $\Delta x = 0.5$) until the absolute error between the approximation and the true integral value is less than some specified tolerance. Record the absolute error at each iteration.
4. Maybe do something with a matrix.

* Input / Output
We have already used the =<iostream>= library to print results to 
the console. However, in many cases, we'd like to read in lots of 
data from a file, pass option flags to the program from the command 
line, or save the results of some computation to a file for further 
analysis.

** Inputs to =main=: =argc= and =argv=
The =main= function has two optional arguments which we have thus far omitted, 
=argc= and =argv=. These arguments allow arguments to passed to the =main= 
function when the program is run. This is how flags and other arguments are 
passed to programs you use from the command line. The first, =argc=, is of 
type, =int=, and stands for arg count. It gives the number of arguments 
to the program. The arg count is always at least 1 because the program's 
name is always the first argument. The second, =argv=, is a double pointer to
=char=. In essence, =argv= is an array of strings.

#+begin_src cpp -n :tangle src/io/args/main.cpp
  #include <iostream>

  int main(int argc, char ** argv) {
    std::cout << "argc = " << argc << "\n";

    for(int i=0; i < argc; i++) {
      std::cout << "argv[" << i << "] = " << argv[i] << "\n";
    }
    return 0;
  }
#+end_src

Compile this program, and run, for example:

#+begin_src bash :exports both :results output :dir src/io/args
  g++ main.cpp
  ./a.out hello 1 2 34
#+end_src

#+RESULTS[53bac763edb87bb7b31f57514f3f5ef4e0f18b5a]:
: argc = 5
: argv[0] = ./a.out
: argv[1] = hello
: argv[2] = 1
: argv[3] = 2
: argv[4] = 34

=argc= and =argv= are handy for setting up large experiments. You could, for 
example, set up your main function so that different functions or parameters 
or used based on the arguments of =arcv=. Then, you could set up a shell 
script that loops through the desired arguments to be supplied to the main 
function.

** Filestreams
File input and output is crucial for numerical experiments with lots of data. 
In this section, we see how to read and write data to files.

