resources/langs/cpp/index.html

<div id="outline-container-4.2.2.1" class="outline-5">
<h5 id="sec-4.2.2.1">4.2.2.1 Example: truncated sum </h5>
<div id="text-4.2.2.1">

<p>In the following example, we approximate the geometric series:
</p>
<p>
$$
1 = &sum;<sub>n=1</sub>^{&infin;} \left(\frac{1}{2}\right)<sup>n</sup>
$$
</p>
<p>
The loop exits when the absolute error, 
</p>
<p>
$$
\text{absolute error} := 1-&sum;<sub>n=1</sub><sup>N</sup>  \left(\frac{1}{2}\right)<sup>n</sup>
$$
</p>
<p>
is less than some specified tolerance, <code>tol</code>.
</p>



<pre class="example">
<span class="linenr"> 1:  </span>  double sum = 0.0;
<span class="linenr"> 2:  </span>  double base = 0.5;
<span class="linenr"> 3:  </span>  double pow = base; // initialize to base^1
<span class="linenr"> 4:  </span>  double tol = 1e-4;
<span class="linenr"> 5:  </span>  int iter = 1;
<span class="linenr"> 6:  </span>
<span class="linenr"> 7:  </span>  while((1-sum) &gt;= tol) {
<span class="linenr"> 8:  </span>    // Add `pow` to `sum`.
<span class="linenr"> 9:  </span>    sum += pow;
<span class="linenr">10:  </span>    // Update `pow` by one power of `base`.
<span class="linenr">11:  </span>    pow *= base;
<span class="linenr">12:  </span>
<span class="linenr">13:  </span>    printf("Iter: %03d, Sum: %.5f, Abs Err: %.5f\n", iter, sum, 1-sum); 
<span class="linenr">14:  </span>
<span class="linenr">15:  </span>    // Update the `iter` val by 1.
<span class="linenr">16:  </span>    iter += 1;
<span class="linenr">17:  </span>  }
</pre>





<pre class="example">
Iter: 001, Sum: 0.50000, Abs Err: 0.50000
Iter: 002, Sum: 0.75000, Abs Err: 0.25000
Iter: 003, Sum: 0.87500, Abs Err: 0.12500
Iter: 004, Sum: 0.93750, Abs Err: 0.06250
Iter: 005, Sum: 0.96875, Abs Err: 0.03125
Iter: 006, Sum: 0.98438, Abs Err: 0.01562
Iter: 007, Sum: 0.99219, Abs Err: 0.00781
Iter: 008, Sum: 0.99609, Abs Err: 0.00391
Iter: 009, Sum: 0.99805, Abs Err: 0.00195
Iter: 010, Sum: 0.99902, Abs Err: 0.00098
Iter: 011, Sum: 0.99951, Abs Err: 0.00049
Iter: 012, Sum: 0.99976, Abs Err: 0.00024
Iter: 013, Sum: 0.99988, Abs Err: 0.00012
Iter: 014, Sum: 0.99994, Abs Err: 0.00006
</pre>




</div>

</div>

<div id="outline-container-4.2.2.2" class="outline-5">
<h5 id="sec-4.2.2.2">4.2.2.2 Example: estimating machine epsilon </h5>
<div id="text-4.2.2.2">





<pre class="example">
<span class="linenr"> 1:  </span>  double eps = 1;
<span class="linenr"> 2:  </span>  int count = 1;
<span class="linenr"> 3:  </span>
<span class="linenr"> 4:  </span>  while(1.0 + eps*0.5 &gt; 1.0) {
<span class="linenr"> 5:  </span>      eps *= 0.5;
<span class="linenr"> 6:  </span>      count += 1;
<span class="linenr"> 7:  </span>  }
<span class="linenr"> 8:  </span>
<span class="linenr"> 9:  </span>  std::cout &lt;&lt; eps &lt;&lt; ", " &lt;&lt; std::numeric_limits&lt;double&gt;::epsilon() &lt;&lt; "\n"
<span class="linenr">10:  </span>            &lt;&lt; count &lt;&lt; ", " &lt;&lt; std::numeric_limits&lt;double&gt;::digits;
</pre>




: 2.22045e-16, 2.22045e-16
: 53, 53

</div>
</div>

</div>

<div id="outline-container-4.2.3" class="outline-4">
<h4 id="sec-4.2.3">4.2.3 The <code>break</code> keyword </h4>
<div id="text-4.2.3">

<p>The <code>break</code> keyword provides a mechanism for exiting the direct parent loop
for which the <code>break</code> statement is placed. For example:
</p>



<pre class="example">
<span class="linenr">1:  </span>  for(int i=0; i &lt; 3; i++) {
<span class="linenr">2:  </span>    while(true) {
<span class="linenr">3:  </span>      std::cout &lt;&lt; "Entering infinite loop number " &lt;&lt; (i+1) &lt;&lt; "\n";
<span class="linenr">4:  </span>      break;
<span class="linenr">5:  </span>    }
<span class="linenr">6:  </span>    std::cout &lt;&lt; "We escaped the infinite loop!\n";
<span class="linenr">7:  </span>  }
</pre>




: Entering infinite loop number 1
: We escaped the infinite loop!
: Entering infinite loop number 2
: We escaped the infinite loop!
: Entering infinite loop number 3
: We escaped the infinite loop!

<p>
The previous example is contrived, but there are situations, where you
might find the break statement within an infinite loop useful. Of course,
you should avoid this sort of thing if there is a more straight-forward 
approach.
</p>


</div>
</div>
</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5">5 Input / Output </h2>
<div id="text-5">

<p>We have already used the <code>&lt;iostream&gt;</code> library to print results to 
the console. However, in many cases, we'd like to read in lots of 
data from a file, pass option flags to the program from the command 
line, or save the results of some computation to a file for further 
analysis.
</p>

</div>

<div id="outline-container-5.1" class="outline-3">
<h3 id="sec-5.1">5.1 Inputs to <code>main</code>: <code>argc</code> and <code>argv</code> </h3>
<div id="text-5.1">

<p>The <code>main</code> function has two optional arguments which we have thus far omitted, 
<code>argc</code> and <code>argv</code>. These arguments allow arguments to passed to the <code>main</code> 
function when the program is run. This is how flags and other arguments are 
passed to programs you use from the command line. The first, <code>argc</code>, is of 
type, <code>int</code>, and stands for arg count. It gives the number of arguments 
to the program. The arg count is always at least 1 because the program's 
name is always the first argument. The second, <code>argv</code>, is a double pointer to
<code>char</code>. In essence, <code>argv</code> is an array of strings.
</p>



<pre class="example">
<span class="linenr"> 1:  </span>  #include &lt;iostream&gt;
<span class="linenr"> 2:  </span>
<span class="linenr"> 3:  </span>  int main(int argc, char ** argv) {
<span class="linenr"> 4:  </span>    std::cout &lt;&lt; "argc = " &lt;&lt; argc &lt;&lt; "\n";
<span class="linenr"> 5:  </span>
<span class="linenr"> 6:  </span>    for(int i=0; i &lt; argc; i++) {
<span class="linenr"> 7:  </span>      std::cout &lt;&lt; "argv[" &lt;&lt; i &lt;&lt; "] = " &lt;&lt; argv[i] &lt;&lt; "\n";
<span class="linenr"> 8:  </span>    }
<span class="linenr"> 9:  </span>    return 0;
<span class="linenr">10:  </span>  }
</pre>




<p>
Compile this program, and run, for example:
</p>



<pre class="example">
  g++ main.cpp
  ./a.out hello 1 2 34
</pre>




: argc = 5
: argv[0] = ./a.out
: argv[1] = hello
: argv[2] = 1
: argv[3] = 2
: argv[4] = 34

<p>
<code>argc</code> and <code>argv</code> are handy for setting up large experiments. You could, for 
example, set up your main function so that different functions or parameters 
or used based on the arguments of <code>arcv</code>. Then, you could set up a shell 
script that loops through the desired arguments to be supplied to the main 
function.
</p>
</div>

</div>

<div id="outline-container-5.2" class="outline-3">
<h3 id="sec-5.2">5.2 Filestreams </h3>
<div id="text-5.2">

<p>File input and output is crucial for numerical experiments with lots of data. 
In this section, we see how to read and write data to files.
</p>

</div>
