resources/langs/cpp/index.org
*** Reading data from a file
    
In general, how data is read in depends heavily on how the data is stored. 
Nevertheless, we will give an example of reading in a vector stored in a 
particular fashion. Suppose a text file exists in the directory, 
=./data/vector.txt=, containing

: 1 2 3.14 4 5 6.28

#+begin_src cpp -n :exports both :tangle src/io/fstreams/in/main.cpp
#include <iostream>
#include <fstream>

int main() {
    std::fstream fin("./data/vector.txt", std::ios_base::in);
    double vector[6];
    int i = 0;
    while(fin >> vector[i]) {
      std::cout << vector[i] << " ";
      i++;
    }
    return 0;
}
#+end_src

#+begin_src sh :exports rewiults :dir src/io/fstreams/in
  g++ main.cpp && ./a.out
#+end_src

#+RESULTS[dc9907de744360bffc1ef8e5bbb81878c2945a2e]:
: 1 2 3.14 4 5 6.28

This simply prints the data in the file back out to the console. Note, however, 
that the data is read into an array of type =double=, so it can be processed 
numerically thereafter.

In this example dealt with simply stored data, and it was 
assumed that the number of data entries was known beforehand. Parsing 
data can become quite complicated depending on how it is stored, and 
depending on the intended format of the data.

*** Writing data to a file
    
Writing to a file is similar, using the =<fstream>= library.

#+begin_src cpp -n :tangle src/io/fstreams/out/main.cpp
  #include <fstream>
  #include <cmath>

  int main() {
    std::fstream fout("./data/new_shiny_data.txt", std::ios_base::out);
    double x;

    fout << "x\tsin(x)\n";

    for(int i=0; i < 11; i++) {
      x = i / 10.0;
      fout << x << "\t" << sin(x) << "\n";
    }

    fout.close();

    return 0;
  }
#+end_src

#+RESULTS[c8a8d5cb7019f16193d8423bfb7f32f278857520]:

#+begin_src sh :exports none :dir src/io/fstreams/out
  g++ main.cpp && ./a.out
#+end_src

#+RESULTS[93337642d8102d27a7d5d685555ccbf4cd69a052]:

This produces a file called =new_shiny_data.txt= in the folder, =data=, 
containing:

#+include: src/io/fstreams/out/data/new_shiny_data.txt src sh

* Functions

So far, we've piled everything into the =main= function. When we have a block of 
code used for a specific subtask, we can offload it to a function. This promotes 
code which is separated based on the subtasks each block is intended to perform. 
This, in turn, makes your code easier to debug and easier to understand.  

** Writing a function
   
A function must be declared before use. Thus, a function usual consists of two
parts, a declaration and an implementation. You must declare the return type 
of a function as well as the types of all the function's arguments. If the 
function is defined in the same file as the =main= function, you should write
the declaration before =main= and the implementation after =main=.

*** Example: =linspace=: generating a set of equally-spaced points

#+begin_src cpp -n :exports both :results output :tangle src/functions/linspace/main.cpp
  #include <iostream>

  // This is the function declaration.
  // You should describe the functions arguments
  // and what is returned by the function in comments
  // near the declaration.
  //
  // `linspace` returns an array of doubles containing
  // `n_points` entries which are equally-spaced, starting
  // at `start` and ending at `stop`.
  double * linspace(double start, double stop, int n_points);

  // `void` is a function with no return type.
  // `print_array` takes an array and prints it to std out.
  void print_array(double * arr, int arr_len);

  int main() {
    double * xs = linspace(-1, 1, 5);
    print_array(xs, 5);
    delete [] xs;

    return 0;
  }

  // Implementation of `linspace`.
  double * linspace(double start, double stop, int n_points) {
    double * arr = new double [n_points];
    double dx = (stop-start) / (n_points-1.0);

    for(int i=0; i < n_points; i++) {
      arr[i] = start + i*dx;
    }

    return arr;
  }

  // Implementation of `print_array`.
  void print_array(double * arr, int arr_len) {
    for(int i=0; i < arr_len; i++) {
      std::cout << arr[i] << "\n";
    }
  }
#+end_src

#+RESULTS[188d6aa51776ba0b2f2f4c47a2aa1a5a0e28c214]:
: -1
: -0.5
: 0
: 0.5
: 1

** Header and implementation files
   
The example in the previous section certainly made the =main= function
cleaner and simpler to understand, having only two function calls. However, 
the file itself was still pretty messy. Thankfully, there is a way to modularize 
further, by creating header and implementation files. Here is how we do it:

*** The header file

Put the declarations from the into a header file, called =my_library.h=:

#+begin_src cpp -n :main no :tangle src/functions/modular/my_library.h
  #ifndef MY_LIBRARY_H
  #define MY_LIBRARY_H

  #include <iostream>

  namespace my_namespace {
      // `linspace` returns an array of doubles containing
      // `n_points` entries which are equally-spaced, starting
      // at `start` and ending at `stop`.
      double * linspace(double start, double stop, int n_points);

      // `void` is a function with no return type.
      // `print_array` takes an array and prints it to std out.
      void print_array(double * arr, int arr_len);
  }

  #endif
#+end_src

Note the the function declarations are wrapped in conditional "macro" 
statments, =#ifndef=, =#define=, and =#endif=. You can think of this 
as protecting your library from being imported twice.

We have also introduced the notion of a =namespace= above. Namespaces 
help to prevent naming clashes between separate libraries. When calling 
a function from a particular namespace, you must write the namespace 
followed by =::= and then the function name. This is why many standard 
library functions like =<iostream>= begin with =std::=.

