resources/langs/cpp/index.html

<div id="outline-container-5.2.1" class="outline-4">
<h4 id="sec-5.2.1">5.2.1 Reading data from a file </h4>
<div id="text-5.2.1">


<p>
In general, how data is read in depends heavily on how the data is stored. 
Nevertheless, we will give an example of reading in a vector stored in a 
particular fashion. Suppose a text file exists in the directory, 
<code>./data/vector.txt</code>, containing
</p>
<pre class="example">
1 2 3.14 4 5 6.28
</pre>




<pre class="example">
<span class="linenr"> 1:  </span>#include &lt;iostream&gt;
<span class="linenr"> 2:  </span>#include &lt;fstream&gt;
<span class="linenr"> 3:  </span>
<span class="linenr"> 4:  </span>int main() {
<span class="linenr"> 5:  </span>    std::fstream fin("./data/vector.txt", std::ios_base::in);
<span class="linenr"> 6:  </span>    double vector[6];
<span class="linenr"> 7:  </span>    int i = 0;
<span class="linenr"> 8:  </span>    while(fin &gt;&gt; vector[i]) {
<span class="linenr"> 9:  </span>      std::cout &lt;&lt; vector[i] &lt;&lt; " ";
<span class="linenr">10:  </span>      i++;
<span class="linenr">11:  </span>    }
<span class="linenr">12:  </span>    return 0;
<span class="linenr">13:  </span>}
</pre>





<pre class="example">
  g++ main.cpp &amp;&amp; ./a.out
</pre>




: 1 2 3.14 4 5 6.28

<p>
This simply prints the data in the file back out to the console. Note, however, 
that the data is read into an array of type <code>double</code>, so it can be processed 
numerically thereafter.
</p>
<p>
In this example dealt with simply stored data, and it was 
assumed that the number of data entries was known beforehand. Parsing 
data can become quite complicated depending on how it is stored, and 
depending on the intended format of the data.
</p>
</div>

</div>

<div id="outline-container-5.2.2" class="outline-4">
<h4 id="sec-5.2.2">5.2.2 Writing data to a file </h4>
<div id="text-5.2.2">


<p>
Writing to a file is similar, using the <code>&lt;fstream&gt;</code> library.
</p>



<pre class="example">
<span class="linenr"> 1:  </span>  #include &lt;fstream&gt;
<span class="linenr"> 2:  </span>  #include &lt;cmath&gt;
<span class="linenr"> 3:  </span>
<span class="linenr"> 4:  </span>  int main() {
<span class="linenr"> 5:  </span>    std::fstream fout("./data/new_shiny_data.txt", std::ios_base::out);
<span class="linenr"> 6:  </span>    double x;
<span class="linenr"> 7:  </span>
<span class="linenr"> 8:  </span>    fout &lt;&lt; "x\tsin(x)\n";
<span class="linenr"> 9:  </span>
<span class="linenr">10:  </span>    for(int i=0; i &lt; 11; i++) {
<span class="linenr">11:  </span>      x = i / 10.0;
<span class="linenr">12:  </span>      fout &lt;&lt; x &lt;&lt; "\t" &lt;&lt; sin(x) &lt;&lt; "\n";
<span class="linenr">13:  </span>    }
<span class="linenr">14:  </span>
<span class="linenr">15:  </span>    fout.close();
<span class="linenr">16:  </span>
<span class="linenr">17:  </span>    return 0;
<span class="linenr">18:  </span>  }
</pre>






<pre class="example">
  g++ main.cpp &amp;&amp; ./a.out
</pre>





<p>
This produces a file called <code>new_shiny_data.txt</code> in the folder, <code>data</code>, 
containing:
</p>



<pre class="example">
x	sin(x)
0	0
0.1	0.0998334
0.2	0.198669
0.3	0.29552
0.4	0.389418
0.5	0.479426
0.6	0.564642
0.7	0.644218
0.8	0.717356
0.9	0.783327
1	0.841471
</pre>




</div>
</div>
</div>

</div>

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6">6 Functions </h2>
<div id="text-6">


<p>
So far, we've piled everything into the <code>main</code> function. When we have a block of 
code used for a specific subtask, we can offload it to a function. This promotes 
code which is separated based on the subtasks each block is intended to perform. 
This, in turn, makes your code easier to debug and easier to understand.  
</p>

</div>

<div id="outline-container-6.1" class="outline-3">
<h3 id="sec-6.1">6.1 Writing a function </h3>
<div id="text-6.1">


<p>
A function must be declared before use. Thus, a function usual consists of two
parts, a declaration and an implementation. You must declare the return type 
of a function as well as the types of all the function's arguments. If the 
function is defined in the same file as the <code>main</code> function, you should write
the declaration before <code>main</code> and the implementation after <code>main</code>.
</p>

</div>

<div id="outline-container-6.1.1" class="outline-4">
<h4 id="sec-6.1.1">6.1.1 Example: <code>linspace</code>: generating a set of equally-spaced points </h4>
<div id="text-6.1.1">





<pre class="example">
<span class="linenr"> 1:  </span>  #include &lt;iostream&gt;
<span class="linenr"> 2:  </span>
<span class="linenr"> 3:  </span>  // This is the function declaration.
<span class="linenr"> 4:  </span>  // You should describe the functions arguments
<span class="linenr"> 5:  </span>  // and what is returned by the function in comments
<span class="linenr"> 6:  </span>  // near the declaration.
<span class="linenr"> 7:  </span>  //
<span class="linenr"> 8:  </span>  // `linspace` returns an array of doubles containing
<span class="linenr"> 9:  </span>  // `n_points` entries which are equally-spaced, starting
<span class="linenr">10:  </span>  // at `start` and ending at `stop`.
<span class="linenr">11:  </span>  double * linspace(double start, double stop, int n_points);
<span class="linenr">12:  </span>
<span class="linenr">13:  </span>  // `void` is a function with no return type.
<span class="linenr">14:  </span>  // `print_array` takes an array and prints it to std out.
<span class="linenr">15:  </span>  void print_array(double * arr, int arr_len);
<span class="linenr">16:  </span>
<span class="linenr">17:  </span>  int main() {
<span class="linenr">18:  </span>    double * xs = linspace(-1, 1, 5);
<span class="linenr">19:  </span>    print_array(xs, 5);
<span class="linenr">20:  </span>    delete [] xs;
<span class="linenr">21:  </span>
<span class="linenr">22:  </span>    return 0;
<span class="linenr">23:  </span>  }
<span class="linenr">24:  </span>
<span class="linenr">25:  </span>  // Implementation of `linspace`.
<span class="linenr">26:  </span>  double * linspace(double start, double stop, int n_points) {
<span class="linenr">27:  </span>    double * arr = new double [n_points];
<span class="linenr">28:  </span>    double dx = (stop-start) / (n_points-1.0);
<span class="linenr">29:  </span>
<span class="linenr">30:  </span>    for(int i=0; i &lt; n_points; i++) {
<span class="linenr">31:  </span>      arr[i] = start + i*dx;
<span class="linenr">32:  </span>    }
<span class="linenr">33:  </span>
<span class="linenr">34:  </span>    return arr;
<span class="linenr">35:  </span>  }
<span class="linenr">36:  </span>
<span class="linenr">37:  </span>  // Implementation of `print_array`.
<span class="linenr">38:  </span>  void print_array(double * arr, int arr_len) {
<span class="linenr">39:  </span>    for(int i=0; i &lt; arr_len; i++) {
<span class="linenr">40:  </span>      std::cout &lt;&lt; arr[i] &lt;&lt; "\n";
<span class="linenr">41:  </span>    }
<span class="linenr">42:  </span>  }
</pre>




: -1
: -0.5
: 0
: 0.5
: 1

</div>
</div>

</div>

<div id="outline-container-6.2" class="outline-3">
<h3 id="sec-6.2">6.2 Header and implementation files </h3>
<div id="text-6.2">


<p>
The example in the previous section certainly made the <code>main</code> function
cleaner and simpler to understand, having only two function calls. However, 
the file itself was still pretty messy. Thankfully, there is a way to modularize 
further, by creating header and implementation files. Here is how we do it:
</p>

</div>

<div id="outline-container-6.2.1" class="outline-4">
<h4 id="sec-6.2.1">6.2.1 The header file </h4>
<div id="text-6.2.1">


<p>
Put the declarations from the into a header file, called <code>my_library.h</code>:
</p>



<pre class="example">
<span class="linenr"> 1:  </span>  #ifndef MY_LIBRARY_H
<span class="linenr"> 2:  </span>  #define MY_LIBRARY_H
<span class="linenr"> 3:  </span>
<span class="linenr"> 4:  </span>  #include &lt;iostream&gt;
<span class="linenr"> 5:  </span>
<span class="linenr"> 6:  </span>  namespace my_namespace {
<span class="linenr"> 7:  </span>      // `linspace` returns an array of doubles containing
<span class="linenr"> 8:  </span>      // `n_points` entries which are equally-spaced, starting
<span class="linenr"> 9:  </span>      // at `start` and ending at `stop`.
<span class="linenr">10:  </span>      double * linspace(double start, double stop, int n_points);
<span class="linenr">11:  </span>
<span class="linenr">12:  </span>      // `void` is a function with no return type.
<span class="linenr">13:  </span>      // `print_array` takes an array and prints it to std out.
<span class="linenr">14:  </span>      void print_array(double * arr, int arr_len);
<span class="linenr">15:  </span>  }
<span class="linenr">16:  </span>
<span class="linenr">17:  </span>  #endif
</pre>




<p>
Note the the function declarations are wrapped in conditional "macro" 
statments, <code>#ifndef</code>, <code>#define</code>, and <code>#endif</code>. You can think of this 
as protecting your library from being imported twice.
</p>
<p>
We have also introduced the notion of a <code>namespace</code> above. Namespaces 
help to prevent naming clashes between separate libraries. When calling 
a function from a particular namespace, you must write the namespace 
followed by <code>::</code> and then the function name. This is why many standard 
library functions like <code>&lt;iostream&gt;</code> begin with <code>std::</code>.
</p>
</div>

</div>
