resources/langs/cpp/index.org
*** The implementation file
    
Create a file called =my_library.cpp= containing the implementations as follows:

#+begin_src cpp -n :main no :tangle src/functions/modular/my_library.cpp
  #include "my_library.h"

  // Implementation of `linspace`.
  double * my_namespace::linspace(double start, double stop, int n_points) {
    double * arr = new double [n_points];
    double dx = (stop-start) / (n_points-1.0);

    for(int i=0; i < n_points; i++) {
      arr[i] = start + i*dx;
    }

    return arr;
  }

  // Implementation of `print_array`.
  void my_namespace::print_array(double * arr, int arr_len) {
    for(int i=0; i < arr_len; i++) {
      std::cout << arr[i] << "\n";
    }
  }
#+end_src

Note that we have to include the header file in quotations at the beginning, 
and the names of the functions must be prepended by the namespace that we've 
given in the header file.

*** The file containing =main=
    
Create a file with the main function, say =main.cpp=:

#+begin_src cpp -n :tangle src/functions/modular/main.cpp
#include <iostream>
#include "my_library.h"

int main() {
    double * xs = my_namespace::linspace(-1,1,5);
    my_namespace::print_array(xs, 5);
    delete [] xs;

    return 0;
}
#+end_src

Now the main function is very nice and clean, but now we 3 separate files we 
must compile into one executable. This is done as follows:

#+begin_src bash :exports both :results output :dir src/functions/modular
  # Convert the library into an object file.
  g++ -c my_library.cpp
  # Compile the main to an executable.
  g++ my_library.o main.cpp
  # Run it.
  ./a.out
#+end_src

#+RESULTS[f67f89c0d068ec352bf05b4621a6f8bc93d91659]:
: -1
: -0.5
: 0
: 0.5
: 1

If successful, you will see the same output [[Writing a function][as previously]].

** Function pointers
   
Pointers can be made to functions, and these function pointers can be used 
as arguments to other functions. We'll look at two functions that accept a 
function pointer as one of their arguments.
   
*** Example: Newton's method for rootfinding
    
Suppose $f: \mathbb{R} \to \mathbb{R}$, and we'd like to find a root of $f$. 
Newton's method is an iterative method for finding roots, which, starting 
from some initial guess, $x_0$, iterates:

$$
    x_{n+1} \leftarrow x_n - \frac{f(x_n)}{f'(x_n)}
$$

For simplicity, we'll dump everything into the file containing =main=, but
you could imagine a libary with many methods for finding roots, which would 
contain Newton's method.

Let's consider $f(x) = x^2 - 2$.

#+begin_src cpp -n :exports both :results output :tangle src/functions/newton/main.cpp
  #include <cmath>
  #include <iostream>

  // The function to find the root of.
  double func(double x);
  // Its derivative.
  double dfunc(double x);

  // Find the root of `f` using Newton's method,
  // starting from `x0` until |f(x)| < `tol` or `max_iters`
  // is reached.
  //
  // Note the first and second arguments are function pointers.
  double newton_root(double (*f)(double), double (*df)(double), double x0,
                     double tol, int max_iters, bool print_iters); 

  int main() {
    double x = newton_root(&func, &dfunc, 1.0, 1e-6, 1000, true);

    return 0;
  }

  double func( double x) { return x*x - 2; }
  double dfunc(double x) { return 2*x; }

  double newton_root(double (*f)(double), double (*df)(double), double x0,
                     double tol, int max_iters, bool print_iters) {
    double x  = x0;
    int iter  = 0;

    while (std::abs(f(x)) > tol && iter < max_iters) {
      if (print_iters) { 
        std::cout << "f(" << x << ") = " << f(x) << "\n";
      }

      // Newton's method update.
      x -= f(x) / df(x);
      iter++;
    }
    
    // One last print if necessary.
    if (print_iters) { 
      std::cout << "f(" << x << ") = " << f(x) << "\n";
    }

    return x;
  }
#+end_src

#+RESULTS[9f25e7b7d701645c163196ec87c539ce982f3880]:
: f(1) = -1
: f(1.5) = 0.25
: f(1.41667) = 0.00694444
: f(1.41422) = 6.0073e-06
: f(1.41421) = 4.51061e-12

