resources/langs/cpp/index.html

<div id="outline-container-6.2.2" class="outline-4">
<h4 id="sec-6.2.2">6.2.2 The implementation file </h4>
<div id="text-6.2.2">


<p>
Create a file called <code>my_library.cpp</code> containing the implementations as follows:
</p>



<pre class="example">
<span class="linenr"> 1:  </span>  #include "my_library.h"
<span class="linenr"> 2:  </span>
<span class="linenr"> 3:  </span>  // Implementation of `linspace`.
<span class="linenr"> 4:  </span>  double * my_namespace::linspace(double start, double stop, int n_points) {
<span class="linenr"> 5:  </span>    double * arr = new double [n_points];
<span class="linenr"> 6:  </span>    double dx = (stop-start) / (n_points-1.0);
<span class="linenr"> 7:  </span>
<span class="linenr"> 8:  </span>    for(int i=0; i &lt; n_points; i++) {
<span class="linenr"> 9:  </span>      arr[i] = start + i*dx;
<span class="linenr">10:  </span>    }
<span class="linenr">11:  </span>
<span class="linenr">12:  </span>    return arr;
<span class="linenr">13:  </span>  }
<span class="linenr">14:  </span>
<span class="linenr">15:  </span>  // Implementation of `print_array`.
<span class="linenr">16:  </span>  void my_namespace::print_array(double * arr, int arr_len) {
<span class="linenr">17:  </span>    for(int i=0; i &lt; arr_len; i++) {
<span class="linenr">18:  </span>      std::cout &lt;&lt; arr[i] &lt;&lt; "\n";
<span class="linenr">19:  </span>    }
<span class="linenr">20:  </span>  }
</pre>




<p>
Note that we have to include the header file in quotations at the beginning, 
and the names of the functions must be prepended by the namespace that we've 
given in the header file.
</p>
</div>

</div>

<div id="outline-container-6.2.3" class="outline-4">
<h4 id="sec-6.2.3">6.2.3 The file containing <code>main</code> </h4>
<div id="text-6.2.3">


<p>
Create a file with the main function, say <code>main.cpp</code>:
</p>



<pre class="example">
<span class="linenr"> 1:  </span>#include &lt;iostream&gt;
<span class="linenr"> 2:  </span>#include "my_library.h"
<span class="linenr"> 3:  </span>
<span class="linenr"> 4:  </span>int main() {
<span class="linenr"> 5:  </span>    double * xs = my_namespace::linspace(-1,1,5);
<span class="linenr"> 6:  </span>    my_namespace::print_array(xs, 5);
<span class="linenr"> 7:  </span>    delete [] xs;
<span class="linenr"> 8:  </span>
<span class="linenr"> 9:  </span>    return 0;
<span class="linenr">10:  </span>}
</pre>




<p>
Now the main function is very nice and clean, but now we 3 separate files we 
must compile into one executable. This is done as follows:
</p>



<pre class="example">
  # Convert the library into an object file.
  g++ -c my_library.cpp
  # Compile the main to an executable.
  g++ my_library.o main.cpp
  # Run it.
  ./a.out
</pre>




: -1
: -0.5
: 0
: 0.5
: 1

<p>
If successful, you will see the same output <a href="#sec-6.1">as previously</a>.
</p>
</div>
</div>

</div>

<div id="outline-container-6.3" class="outline-3">
<h3 id="sec-6.3">6.3 Function pointers </h3>
<div id="text-6.3">


<p>
Pointers can be made to functions, and these function pointers can be used 
as arguments to other functions. We'll look at two functions that accept a 
function pointer as one of their arguments.
</p>

</div>

<div id="outline-container-6.3.1" class="outline-4">
<h4 id="sec-6.3.1">6.3.1 Example: Newton's method for rootfinding </h4>
<div id="text-6.3.1">


<p>
Suppose $f: \mathbb{R} &rarr; \mathbb{R}$, and we'd like to find a root of $f$. 
Newton's method is an iterative method for finding roots, which, starting 
from some initial guess, $x<sub>0</sub>$, iterates:
</p>
<p>
$$
x<sub>n+1</sub> &larr; x<sub>n</sub> - \frac{f(x<sub>n</sub>)}{f'(x<sub>n</sub>)}
$$
</p>
<p>
For simplicity, we'll dump everything into the file containing <code>main</code>, but
you could imagine a libary with many methods for finding roots, which would 
contain Newton's method.
</p>
<p>
Let's consider $f(x) = x<sup>2</sup> - 2$.
</p>



<pre class="example">
<span class="linenr"> 1:  </span>  #include &lt;cmath&gt;
<span class="linenr"> 2:  </span>  #include &lt;iostream&gt;
<span class="linenr"> 3:  </span>
<span class="linenr"> 4:  </span>  // The function to find the root of.
<span class="linenr"> 5:  </span>  double func(double x);
<span class="linenr"> 6:  </span>  // Its derivative.
<span class="linenr"> 7:  </span>  double dfunc(double x);
<span class="linenr"> 8:  </span>
<span class="linenr"> 9:  </span>  // Find the root of `f` using Newton's method,
<span class="linenr">10:  </span>  // starting from `x0` until |f(x)| &lt; `tol` or `max_iters`
<span class="linenr">11:  </span>  // is reached.
<span class="linenr">12:  </span>  //
<span class="linenr">13:  </span>  // Note the first and second arguments are function pointers.
<span class="linenr">14:  </span>  double newton_root(double (*f)(double), double (*df)(double), double x0,
<span class="linenr">15:  </span>                     double tol, int max_iters, bool print_iters); 
<span class="linenr">16:  </span>
<span class="linenr">17:  </span>  int main() {
<span class="linenr">18:  </span>    double x = newton_root(&amp;func, &amp;dfunc, 1.0, 1e-6, 1000, true);
<span class="linenr">19:  </span>
<span class="linenr">20:  </span>    return 0;
<span class="linenr">21:  </span>  }
<span class="linenr">22:  </span>
<span class="linenr">23:  </span>  double func( double x) { return x*x - 2; }
<span class="linenr">24:  </span>  double dfunc(double x) { return 2*x; }
<span class="linenr">25:  </span>
<span class="linenr">26:  </span>  double newton_root(double (*f)(double), double (*df)(double), double x0,
<span class="linenr">27:  </span>                     double tol, int max_iters, bool print_iters) {
<span class="linenr">28:  </span>    double x  = x0;
<span class="linenr">29:  </span>    int iter  = 0;
<span class="linenr">30:  </span>
<span class="linenr">31:  </span>    while (std::abs(f(x)) &gt; tol &amp;&amp; iter &lt; max_iters) {
<span class="linenr">32:  </span>      if (print_iters) { 
<span class="linenr">33:  </span>        std::cout &lt;&lt; "f(" &lt;&lt; x &lt;&lt; ") = " &lt;&lt; f(x) &lt;&lt; "\n";
<span class="linenr">34:  </span>      }
<span class="linenr">35:  </span>
<span class="linenr">36:  </span>      // Newton's method update.
<span class="linenr">37:  </span>      x -= f(x) / df(x);
<span class="linenr">38:  </span>      iter++;
<span class="linenr">39:  </span>    }
<span class="linenr">40:  </span>    
<span class="linenr">41:  </span>    // One last print if necessary.
<span class="linenr">42:  </span>    if (print_iters) { 
<span class="linenr">43:  </span>      std::cout &lt;&lt; "f(" &lt;&lt; x &lt;&lt; ") = " &lt;&lt; f(x) &lt;&lt; "\n";
<span class="linenr">44:  </span>    }
<span class="linenr">45:  </span>
<span class="linenr">46:  </span>    return x;
<span class="linenr">47:  </span>  }
</pre>




: f(1) = -1
: f(1.5) = 0.25
: f(1.41667) = 0.00694444
: f(1.41422) = 6.0073e-06
: f(1.41421) = 4.51061e-12

</div>

</div>
