resources/langs/cpp/index.org
*** Example: The midpoint rule for definite integrals
    
The midpoint rule is a numerical integration method which approximates 
the definite integral of a specified function over a specified interval 
using a specified number of subintervals where on each subinterval, the 
area under the curve is approximated by a rectangle whose width is the 
width of the subinterval and whose height is the height of the function 
at the midpoint between the points defining the end points of the subinterval.

Specifically, if $n$ equally-sized subintervals are used on $[a,b]$, then
the midpoint rule approximation, $M_n$, to the definite integral of $f(x)$ 
on $[a,b]$ is: 

$$
    \int_a^b f(x) \; dx \approx \sum_{i=1}^n f\left( \frac{x_{i-1}+x_i}{2} \right) \Delta x =: M_n
$$

where $\Delta x = \frac{b-a}{n}$, and $x_i = a + i \cdot \Delta x, \;\; i=0, 1, \ldots, n$.

Let's consider $f(x) = \frac{1}{x}$ on $[1, e]$.

#+begin_src cpp -n :exports both :results output :tangle src/functions/midpoint/main.cpp
  #include <iostream>
  #include <cmath>

  const double E = std::exp(1.0);

  // The function to be integrated.
  double func(double x);

  // Compute the midpoint rule approximation to
  // the definite integral of `f` from `a` to `b`
  // using `n` subintervals.
  double midpoint_rule(double (*f)(double), double a, double b, int n);


  int main() {
    for(int n=2; n <= 20; n += 2) {
      std::cout << "n = " << n << ", "
                << "M_n = " << midpoint_rule(&func, 1, E, n) << "\n";
    }

    return 0;
  }

  double func(double x) { return 1.0 / x; }

  double midpoint_rule(double (*f)(double), double a, double b, int n) {
    double xi;
    double xi_prev = a;
    double dx = (b-a) / n;
    double sum;

    for(int i=1; i <= n; i++) {
      xi = a + i*dx;
      sum += f(0.5*(xi_prev + xi));
      xi_prev = xi;
    }

    return sum*dx;
  }
#+end_src

#+RESULTS[ca52deecf244e393f0c6945caf6157b820cfa76f]:
#+begin_example
n = 2, M_n = 0.97636
n = 4, M_n = 0.993575
n = 6, M_n = 0.997091
n = 8, M_n = 0.998353
n = 10, M_n = 0.998942
n = 12, M_n = 0.999264
n = 14, M_n = 0.999459
n = 16, M_n = 0.999585
n = 18, M_n = 0.999672
n = 20, M_n = 0.999734
#+end_example

* Object-oriented programming
  
New data types can be created by writing a new =class=. A =class= has 
state variables and functions that act on the state variables. An instance 
of a =class= is called an *object*. Let's write a =vector= class that 
improves upon the default =double= array.

** Example: a vector =class=
   
*** The header file

Create the header file, =vector.h=:

#+include: ./vector/init/vector.h src cpp -n

First note the macro guards, =#ifndef=, =#define=, and =#endif=, as well as the 
namespace, =vec=, wrapping the =class= declaration. Macro guards and namespaces 
were previously discussed when we initially introduced 
[[Header and implementation files][how to write header and implementation files]]. 

Now, within the namespace, we've declared a class, =vector=, which 
contains =public= and =private= variables and function declarations. Private 
functions and variables may only be accessed through the public methods. This 
means if you created an instance of the class, =vector=, you would not be able 
to access the private variable directly. You could only call the *public 
member-functions*, which, in turn, may manipulate the 
*private member-variables*, or call the *private member-functions*. 
Splitting variables and functions into public and private helps to ensure 
that other libraries and programs use your class as intended.

Thus far, this class has 5 public member-functions, 2 private member-variables, 
and 1 private member-function. The first two member functions are special, 
the *constructor* and *destructor*, respectively. The constructor is called 
explicitly when you declare a new instance of this class, while the destructor 
is usually called implicitly when the object is deleted or when it goes out of 
scope.

Notice that the method for accessing elements of =vector= is called =element= 
and its return type is a *reference* ([[References][discussed previously]]). This allows us 
to use this function on both the left side of assignment operators, i.e., to 
assign values to =vector= components, and on the right side of assignments, 
i.e., to treat it as the value of the component.

